{"documents":[{"abstract":"The demand for cost-effective and ecologically sustainable components of machine tools is increasing continuously. Synchronous reluctance machines (SynRM) have become more and more attractive for variable speed drive applications in recent years due to the absence of permanent magnets. Advanced control approaches such as Linear Quadratic Integral (LQI) controllers or model predictive controllers (MPC) are well explored for permanent magnet synchronous machines (PMSM). This paper simulatively investigates these controllers for a SynRMdriven feed drive axis in machine tools. To evaluate this new drive concept, a simple model for SynRM considering the non-linear motor parameters is introduced. Advanced control approaches, i.e. a combination of Dead-Beat predictive controller and (LQI) controller is proposed for the position control task for SynRM in feed drives. The dynamic behavior of the feed drive system is modelled as a mass-spring-damper, which is taken into account when designing the optimal controllers. The aim is to achieve an optimal position/speed control with high bandwidth and low sensitivity to disturbances, such as torque ripples and sudden load changes. The control performance is compared with classic Proportional Integral (PI) controllers in both time domain and frequency domain through simulation.","autors":"T. Xi; S. Kehne; M. Fey; C. Brecher","citation-count":null,"id":"0","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9872831","publication-year":"2022","title":"Application of Optimal Control for Synchronous Reluctance Machines in Feed Drives of Machine Tools","topics":[{"affinity":0.007535303011536598,"id":0},{"affinity":0.9924647212028503,"id":1}]},{"abstract":"This paper presents a comparative analysis of double rotor synchronous reluctance machines. Different topologies of the proposed machine have been investigated, such as double rotor with double-sided stator and double rotor with single-sided stator machines. A comparison between these topologies has been conducted to understand the potential of improving the machine capabilities in terms of high average torque/power density, with respect to the conventional synchronous reluctance machine. The benefits of a double rotor topology are described in detail considering different number of stator slots. Furthermore, given the higher structural complexity with respect to a single airgap machine, a mechanical analysis of the inner and outer rotors has been conducted to assess the robustness of the inner and outer rotors iron ribs.","autors":"M. Al-Ani; H. Mahmoud; M. Degano; C. Gerada","citation-count":1.0,"id":"1","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8506898","publication-year":"2018","title":"Double Rotor Synchronous Reluctance Machine: Analysis towards Torque Capability","topics":[{"affinity":0.9893008470535278,"id":0},{"affinity":0.010699118487536907,"id":1}]},{"abstract":"Electrification in railway industry offers better performing trains with reduced pollution and maximised capacity. SynREL is gaining more interest as a candidate for traction application in place of IM due to its simple and robust structure. Consequently, induction machine (IM) and synchronous reluctance machine (SynREL) are designed and compared for same electrical (1.5 kV and 170 A), thermal and mechanical specification in this paper. IM is found to have a higher torque capability than SynREL for the same torque speed characteristics. Around 67% of the torque at both rated and maximum speed of operation is achieved by SynREL in relation to the specification. The absence of rotor cage improves the efficiency and reduces the weight of SynREL However, SynREL is found to suffer from poor power factor.","autors":"L. Tom; M. R. Khowja; R. Ramanathan; G. Vakil; C. Gerada; P. Anpalahan; K. Wejrzanowski; N. Brown","citation-count":null,"id":"10.1109/ICEM51905.2022.9910767","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9910767","publication-year":"2022","title":"Comparative Analysis of Synchronous Reluctance Machine against Conventional Induction Machine for Railway Traction","topics":[{"affinity":0.011796561069786549,"id":0},{"affinity":0.9882034659385681,"id":1}]},{"abstract":"Because of high requirements in power, efficiency, installation space and weight, the design of electrical machines for hybrid electrical vehicles is a particular challenge. In order to make an informed decision, several machine types are pre-dimensioned by means of analytical formulae and compared with respect to their power density, efficiency and their applicability in hybrid vehicle concepts. The analytical pre-designs are evaluated by the finite element method (FEM). With regard to a parallel hybrid system with a very restricted installation space, a further study is performed on the permanent magnet excited synchronous machine, preferred for its highest power density and overall efficiency.","autors":"T. Finken; M. Felden; K. Hameyer","citation-count":94.0,"id":"10.1109/ICELMACH.2008.4800044","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4800044","publication-year":"2008","title":"Comparison and design of different electrical machine types regarding their applicability in hybrid electrical vehicles","topics":[{"affinity":0.015866899862885475,"id":0},{"affinity":0.9841330647468567,"id":1}]},{"abstract":"It is the purpose of this code to define uniform acceptable methods of making tests to determine that the performance and other characteristics of d-c rotating machines for aircraft comply with specification and application requirements. This code covers rotating machines which operate from or are connected to a direct-current system of an aircraft.","autors":null,"citation-count":null,"id":"10.1109/IEEESTD.1953.7438713","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7438713","publication-year":"1953","title":"AIEE Test Code for D-C Aircraft Rotating Machines","topics":[{"affinity":0.02307259291410446,"id":0},{"affinity":0.9769273996353149,"id":1}]},{"abstract":"Electrical machine control is the essential technology in motion control field. Electrical machine is adding the network communication module in their traditional control unit, while motion control is stretching its way toward remote motion control domain. The Web-based network motion control is really a way to develop remote motion control in an open area; it gives more chances to operate and update the motion control equipments far from the workshop. The author aims at applying an extending network communication module to the traditional electrical machine control unit and some special problems aroused from making use of J2EE Platform technology in electrical machine control, such as the interface between software and control unit of electrical machine control, and the server of the remote electrical machine control. In this paper a subminiature permanent DC motor is connected to the server via RS232 serial port and is also used as an object for remote control, the author present the difficulties in building the B/S (Browser/Server) structure which can operate the electric machine through the Internet far from our lab, and gives some possible ways and some novel ideal to solve the problem","autors":"Wu Zhuanfeng; Liu Weiguo; Zhou Xiwei; Ma Xin","citation-count":2.0,"id":"10.1109/ICEMS.2005.202831","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1638069","publication-year":"2005","title":"Study on web-based network electrical machine control","topics":[{"affinity":0.993769109249115,"id":0},{"affinity":0.0062308902852237225,"id":1}]},{"abstract":"This contribution presents a Modelica library for the simulation of electrical asymmetries in multiphase machines -the ExtendedMachines library. Simulation models of squirrel cage and slip ring induction machines, permanent magnet and electrical excited synchronous machines and reluctance machines are introduced. The object oriented model approach, in particular with respect to various models abstractions is elaborated.","autors":"C. Kral; A. Haumer; F. Pirker","citation-count":3.0,"id":"10.1109/DEMPED.2007.4393104","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4393104","publication-year":"2007","title":"A Modelica Library for the Simulation of Electrical Asymmetries in Multiphase Machines - The ExtendedMachines Library","topics":[{"affinity":0.7375126481056213,"id":0},{"affinity":0.2624872922897339,"id":1}]},{"abstract":"This paper presents a comparison of two rare-earth less outer rotor electrical machines suitable for industrial applications like fans, conveyors etc. After few basic theoretical considerations on an induction machine and a variable reluctance synchronous machine, a study based on numerical analysis is performed for both machines. The most important electro-mechanical quantities of the analyzed structures are obtained from steady state and transient regime calculations. Conclusions regarding the performed study are presented in the final part of the paper.","autors":"R. A. Inţe; D. -C. Popa; F. N. Jurca; C. Marţiş","citation-count":null,"id":"10.1109/MPS.2019.8759701","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8759701","publication-year":"2019","title":"Comparison of the Electromagnetic Performances of Rare Earth-less Outer Rotor Electrical Machines","topics":[{"affinity":0.9843714237213135,"id":0},{"affinity":0.01562858559191227,"id":1}]},{"abstract":"A new machining error prediction approach, which is based on the weighted least squares support vector machine (LS-SVM), was given. The nearer sample was set a larger weight, while the farther was set the smaller weight in the history data. In the same condition, the results show that the prediction accuracy of the weighted LS-SVM is 40% higher than that of the standard LS-SVM. Compared with other more modeling approaches, the prediction effect indicates that the proposed method is more accurate and can be realized more easily. It provides a better way for on-line quality monitoring and controlling of dynamic machining","autors":"Dehui Wu; Shiyuan Yang; Hua Dong","citation-count":3.0,"id":"10.1109/WCICA.2006.1713290","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1713290","publication-year":"2006","title":"Prediction Method for Machining Quality Based on Weighted Least Squares Support Vector Machine","topics":[{"affinity":0.9872016906738281,"id":0},{"affinity":0.012798268347978592,"id":1}]},{"abstract":"At present, the large-scale workpiece need to be measured on the coordinate measuring machine(CMM) in the manufacturing process resulting in low efficiency and hard quality controlling. In this paper, an image mosaic method for on-machine vision measurement of large-scale workpiece was presented. The camera was mounted on the numerical controlled milling machine to acquire multi-images by controlling the moving of working table. Rule of image taking, definition of overlapped image pairs, feature point detection and projective matrix computation were discussed. Image mosaic of large-scale workpiece with high precision was realized. Size measurement result proved the effectiveness and high efficiency of this method.","autors":"Z. Wang; S. Wang; Y. Quan","citation-count":2.0,"id":"10.1109/MVHI.2010.85","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5532631","publication-year":"2010","title":"Image Mosaic for On-machine Measurement of Large-Scale Workpiece","topics":[{"affinity":0.01118225883692503,"id":0},{"affinity":0.9888177514076233,"id":1}]},{"abstract":"This paper focuses on a permanent magnet assisted synchronous reluctance machine with eccentric rotor, comparing with concentric rotor case, in terms of their vibration level. A 4 pole/36 slots permanent magnet assisted synchronous reluctance machine is adopted in this paper as a case study. An analytical model for predicting the airgap flux density and the electromagnetic force is firstly proposed. This is then validated by means of finite element simulations. The objective of the paper is to understand and compare the vibration level in a permanent magnet assisted synchronous reluctance machine in case of eccentric rotor position. To this aim, both static and dynamic eccentricity conditions are analyzed and compared based on finite element vibrational analyses.","autors":"J. Li; H. Mahmoud; M. Degano; A. Bardalai; X. Zhang; C. Gerada","citation-count":1.0,"id":"10.1109/ICEM49940.2020.9270956","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9270956","publication-year":"2020","title":"Impact on Vibration of Eccentric Permanent Magnet Assisted Synchronous Reluctance Machine","topics":[{"affinity":0.027628188952803612,"id":0},{"affinity":0.9723718166351318,"id":1}]},{"abstract":"Diagnostics of electrical machines windings insulation technical condition is an important issue from the viewpoint of machines reliability and operational hazard. The proposed insulation tests utilise dc voltage and consist of three related procedures. After running the tests, the obtained data is classified and insulation graded in accordance with proposed criteria. These criteria are presented in the paper. The problem has been illustrated by real-life examples of several electrical machines tests' results.","autors":"T. Glinka; J. Bernatt; A. Decner; A. Polak","citation-count":2.0,"id":"10.1109/ICELMACH.2008.4800205","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4800205","publication-year":"2008","title":"Electrical Machines Windings Insulation Diagnostics and Degree of Wear Classification","topics":[{"affinity":0.01710354909300804,"id":0},{"affinity":0.9828964471817017,"id":1}]},{"abstract":"Multi-Three-Phase machines are increasingly popular due to the inherent benefits of modularity and fault-tolerance. However, modelling Multi-Three-Phase machines behaviour can be an arduous task. The system complexity may require iterated computationally demanding procedures involving Finite Element software to derive realistic inductance matrices and the harmonic content of the Back Electro-Motive Force. This paper demonstrates a comprehensive simplified analytical method for numerically computing the Magneto-Motive Force, torque, inductance matrix and the Back Electro-Motive Force of Multi-Three-Phase machines. The results are compared with Finite Element Models, for the same machine geometry of a three-phase and nine-phase machine, showing a difference below four percent on the evaluation of the inductance matrix.","autors":"A. Galassini; A. Marfoli; A. Trentin; S. Papadopoulos; G. Sala; G. Buticchi; M. Degano; C. Gerada","citation-count":null,"id":"10.1049/icp.2021.1170","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9545445","publication-year":"2020","title":"A SIMPLIFIED ANALYTICAL APPROACH FOR THE ANALYSIS OF MULTI-THREE-PHASE SURFACE PERMANENT MAGNET ELECTRICAL MACHINES","topics":[{"affinity":0.9906725883483887,"id":0},{"affinity":0.00932738184928894,"id":1}]},{"abstract":"Surface permanent magnet machines gain more and more attention over recent years due to their high power density and high efficiency. This paper compares the Vernier machine and surface permanent magnet synchronous machine in electromagnetic structure, operating principle, and steady-state performances. FEA results are used to verify the analytical equations for comparing Vernier machine and SPM machine performance, with the exact dimensions, in terms of back-EMF, cogging torque, torque generation capability, and torque ripple. Moreover, the machine's back-EMF and torque performances regarding magnet thickness show that the Vernier machine utilizes magnets better than the surface PM machine.","autors":"K. Chen; B. Sarlioglu","citation-count":null,"id":"10.1109/OPTIM-ACEMP50812.2021.9590078","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9590078","publication-year":"2021","title":"Vernier Machine Analysis and Analytical Design for Traction Applications","topics":[{"affinity":0.015272542834281921,"id":0},{"affinity":0.9847274422645569,"id":1}]},{"abstract":"Most of Contactless Power Transfer Systems (CPTS) have independent structure to improve power transmission efficiency. Sometimes, however, CPTS needs to be a part of moving system to reduce overall system volume. Therefore, this paper proposes a CPTS combined with a linear electric machine loading robots. A prototype CPTS has been constructed for testing and performance evaluation. This paper examines the performance of the prototype by simulation and test with AC-voltage source and PWM-voltage source.","autors":"J. -Y. Lee; I. -J. Lee; J. -W. Kim; J. -H. Chang; D. -H. Kang; S. -U. Chung; J. -P. Hong","citation-count":3.0,"id":"10.1109/ICEMS12746.2007.4412286","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4412286","publication-year":"2007","title":"Contactless power transfer system combined with linear electric machine","topics":[{"affinity":0.016691846773028374,"id":0},{"affinity":0.9833081364631653,"id":1}]},{"abstract":"This paper proposes a modular cross-coupling controller to improve the contouring and tool orientation accuracies in 5-axis CNC machining. The proposed cross-coupling controller is based on real-time estimation of contour and tool orientation errors. In the proposed controller, a 3-diemnsional contour error model and a newly introduced tool orientation error model can provide accurate information respectively on contour and tool orientation errors in real time for an arbitrary machined surface. Both models utilize only interpolator outputs and position and angle feedback from each axis. Therefore, the proposed controller offers a modular structure and can be easily integrated with any type of existing interpolators and servo controllers in a plug and play manner without any additional hardware. The proposed cross-coupling controller coordinates five axes of motion simultaneously, resulting in better performance than the conventional individual axis controllers. The accuracy of the 3-dimensional contour error and new tool orientation error models is compared with that of the existing model. The performance of the proposed cross-coupling controller is also evaluated by computer simulations in comparison with the conventional controller and the existing 5-axis cross-coupling controller.","autors":"S. Jee; H. Lee; J. Byun; D. Sung; T. Jang","citation-count":3.0,"id":"10.1109/ICSMA.2008.4505643","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4505643","publication-year":"2008","title":"Modular Cross-Coupling Controller for 5-Axis Machine Tools","topics":[{"affinity":0.9939042925834656,"id":0},{"affinity":0.006095738150179386,"id":1}]},{"abstract":"The intention of the present paper is to draw a reasonable comparison of two different types of electrical machines for use in a parallel hybrid drive train: the induction machine with cage rotor on the one hand, the permanent magnet synchronous machine on the other hand. Both machine types have been designed for application in a mild hybrid vehicle. By dint of simulation models and a total vehicle simulation system the machines were compared on their different loss behavior during several driving cycles to find out which one meets the given demands.","autors":"D. Bucherl; R. Nuscheler; W. Meyer; H. -G. Herzog","citation-count":23.0,"id":"10.1109/ICELMACH.2008.4800155","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4800155","publication-year":"2008","title":"Comparison of electrical machine types in hybrid drive trains: Induction machine vs. permanent magnet synchronous machine","topics":[{"affinity":0.0179514829069376,"id":0},{"affinity":0.982048511505127,"id":1}]},{"abstract":"In sea-bottom drilling/coring, a big Boring Machine System on sea-bottom or a big on-board Boring Machine System is usually used. Such system requires a big ship and a specialized capability, and can get long cores, but it will take a long working duration for one core recovery, and hence it will be difficult to drill/core many points in short time for grasping the features of the targeted wide area. In order to cope with this situation, a new type drilling system has been developed and tested on a sea floor. This system is so small as to be carried and handled by work-class ROV and can drill/core at multiple places in one dive of ROV. This machine is handled by ROV's manipulator and can get short cores at an arbitrary angle set by the manipulator (see Fig. 1). While drilling, ROV can clearly watch the drilling and coring works without being disturbed by the cloud of dust. Also, this system can perform high-speed drilling/coring and the direction of the recovered core can be confirmed very easily. This system can be applied to various works such as wide area survey or grid survey utilizing high-speed and multiple drilling/coring capability, or paleomagnetic survey by orientation confirmation of the cores. This paper shows the mechanism of this new system and sea-trial results.","autors":"F. Tajima; T. Yamazaki; O. Ishizuka; T. Fukazawa; N. Uto; Y. Imai; K. Suetsugu; S. Sorimachi; K. Itoda; S. Takagawa","citation-count":null,"id":"10.1109/OCEANSKOBE.2018.8559176","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8559176","publication-year":"2018","title":"Development of a Small Drilling/Coring Machine for ROV to Get Cores at Multiple Places in One Dive","topics":[{"affinity":0.005456576589494944,"id":0},{"affinity":0.9945434331893921,"id":1}]},{"abstract":"Many alternating-current rotating electric machines are designed to have multiturn form-wound stator coils. In these cases, the winding has two separate but interrelated insulating barriers: one (turn insulation) between the various turns and the second (ground insulation) between the turns and ground. Failure of either of these barriers will prematurely terminate the service life of the machine. A test level, twice rated voltage plus 1 kV, for the ground insulation has been in existence for many years. This guide suggests methods and test levels for the turn insulation.;Many alternating-current rotating electric machines are designed to have multiturn formwound stator coils. In these cases, the winding has two separate but interrelated insulating barriers: one (turn insulation) between the various turns and the second (ground insulation) between the turns and ground. Failure of either of these barriers will prematurely terminate the service life of the machine. A test level, twice rated voltage plus 1 kV, for the ground insulation has been in existence for many years. This guide suggests methods and test levels for the turn insulation.","autors":null,"citation-count":null,"id":"10.1109/IEEESTD.1977.7430201","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7430201","publication-year":"1977","title":"IEEE Guide for Testing Turn-to-Turn Insulation on Form-Wound Stator Coils for Alternating-Current Rotating Electric Machines - For Trail Use","topics":[{"affinity":0.005782384891062975,"id":0},{"affinity":0.9942176342010498,"id":1}]},{"abstract":"This paper investigates an improved fuzzy multicategory support vector machines classifier (IFMSVM). It uses knowledge of the ambiguity associated with the membership of data samples of a given class and relative location to the origin, to improve classification performance with high generalization capability. In some aspects, classifying accuracy of the new algorithm is better than that of the classical support vector classification algorithms. Numerical simulations show the feasibility and effectiveness of this algorithm","autors":"X. -z. Wang; S. -x. Lu","citation-count":8.0,"id":"10.1109/ICMLC.2006.258575","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4028692","publication-year":"2006","title":"Improved Fuzzy Multicategory Support Vector Machines Classifier","topics":[{"affinity":0.9856266975402832,"id":0},{"affinity":0.014373335987329483,"id":1}]},{"abstract":"This paper proposes a new fuzzy multicategory support vector machines (FMSVM) classifier. The main idea is that the proposed FMSVM uses knowledge of the ambiguity associated with the membership of samples for a given class and the relative location of samples to the origin. Compared with the existing SVMs, the new proposed FMSVM that uses the L2-norm in the objective function has the improvement in aspects of classification accuracy and reducing the effects of noises and outliers.","autors":"S. -X. Lu; X. -H. Liu; J. -H. Zhai","citation-count":2.0,"id":"10.1109/ICMLC.2007.4370635","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4370635","publication-year":"2007","title":"A New Fuzzy Multicategory Support Vector Machines Classifier","topics":[{"affinity":0.9855635166168213,"id":0},{"affinity":0.014436512254178524,"id":1}]},{"abstract":"This paper focuses on the multi-objective optimization of an air-cored axial flux permanent magnet synchronous machine (AFPMSM) with segmented PMs. Support vector machine based on radial basis kernel function is combined with orthogonal design to create the surrogate model between output performance and design parameters of a coreless AFPMSM with segmented PMs efficiently, and genetic algorithm is used to obtain the global optimal solutions to decrease the torque ripple and increase the output torque. The effectiveness of the proposed method is verified by finite element analysis.","autors":"W. Le; M. Lin; L. Jia; J. Ai; X. Fu; Z. Chen","citation-count":5.0,"id":"10.1109/ICEMS.2019.8922465","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8922465","publication-year":"2019","title":"Multi-Objective Optimization of an Air-Cored Axial Flux Permanent Magnet Synchronous Machine with Segmented PMs based on Support Vector Machine and Genetic Algorithm","topics":[{"affinity":0.03108161874115467,"id":0},{"affinity":0.9689183831214905,"id":1}]},{"abstract":"In variable speed drives mechanical and thermal phenomena interfere with electromagnetic ones. When it comes to permanent magnets (PM) machines, beside the common problems related to the stator winding insulation damage at high levels of current densities, some supplementary issues are revealed at the rotor core: mechanical stress due to centrifugal forces while high speed is attempted or the irreversible demagnetization risk of the PM, since its operating point varies with the temperature. The paper presents the study of a PM synchronous machine with a supplementary field coil on the rotor. Analytical calculation and numerical computation through finite element method (FEM), accompanied by experimental tests, will reveal the behaviour of the proposed machine and will validate the applied design procedure in terms of safe operation.","autors":"D. Fodorean; I. . -A. Viorel; A. Djerdir; A. Miraoui","citation-count":3.0,"id":"10.1109/ACEMP.2007.4510553","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4510553","publication-year":"2007","title":"Mechanical and thermal designing aspects for a PM synchronous machine with wound rotor","topics":[{"affinity":0.011148577556014061,"id":0},{"affinity":0.9888514280319214,"id":1}]},{"abstract":"This paper investigates the capability of both permanent magnet synchronous machine (PMSM) and permanent magnet flux switching (PMFS) machine to provide high torque to inertia ratio for applications with demanding response in terms of acceleration and fast dynamic. The PMSM has higher torque density and efficiency among different electrical machines. However, the presence of the permanent magnets can increase the rotor inertia. Thanks to its passive salient-pole rotor, PMFS machine is a suitable solution for those applications requiring lower inertia. This paper provides a comparative analysis between the PMSM and PMFS machines considering the torque to inertia ratio, the challenges of a flooded air gap and dimensional constraints. The electromagnetic performances of both machines have been evaluated by means of finite element method and a detailed sensitivity analysis is carried out for stator and rotor geometry.","autors":"A. Al-Timimy; P. Giangrande; M. Degano; M. Galea; C. Gerada","citation-count":25.0,"id":"10.1109/WEMDCD.2017.7947722","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7947722","publication-year":"2017","title":"Comparative study of permanent magnet-synchronous and permanent magnet-flux switching machines for high torque to inertia applications","topics":[{"affinity":0.9415863156318665,"id":0},{"affinity":0.05841365456581116,"id":1}]},{"abstract":"This paper presents work done on the analysis of a new permanent magnet machine topology using finite element in order to achieve high torque density specifically for an automotive application. Also different types of electric motors that are suitable for automotive applications are shown. A comparison between these different machines is given by highlighting some of their advantages and disadvantages.","autors":"Y. A. Alamoudi; G. J. Atkinson; B. C. Mecrow","citation-count":1.0,"id":"10.1049/cp.2012.0186","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6242035","publication-year":"2012","title":"High torque density permanent magnet machine for automotive applications","topics":[{"affinity":0.02849227748811245,"id":0},{"affinity":0.971507728099823,"id":1}]},{"abstract":"Since the cost of rare-earth permanent magnet (PM), such as NdFeB and SmCo, is more and more increasing, there is a great interest in designing PM machines without adopting such a rare-earth PMs, that is, replacing them with cheaper Ferrite magnet. Referring to the interior PM machines, the expected performance reduction is limited thanks to the anisotropic structure, compensating the use of low energy PMs by means of the reluctance torque component. This paper investigates the convenience of adopting Ferrite magnet in an interior PM machine (sometimes also referred to as PM assisted synchronous reluctance machine), instead of rare-earth surface PM machine. It is shown that, even though a slight lengthening of the stack length, the anisotropic PM machines, using Ferrite magnets, may represents a valid competitor of a surface PM machine.","autors":"M. Barcaro; N. Bianchi","citation-count":52.0,"id":"10.1109/ICElMach.2012.6350051","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6350051","publication-year":"2012","title":"Interior PM machines using Ferrite to substitute rare-earth surface PM machines","topics":[{"affinity":0.011405043303966522,"id":0},{"affinity":0.9885950088500977,"id":1}]},{"abstract":"The goal of this paper is to propose a novel concept of permanent magnet machine with integrated airfoil-shaped rotor that can perform compression action. Electrically driven conventional compressor systems need electric machines as prime movers to provide mechanical energy to rotate the compressor. The proposed novel integrated permanent magnet machine system synthesizes both an electric machine and an axial-flow compressor into a single device to convert electrical power to mechanical rotational power of the rotor, which simultaneously compresses the gas. This novel integrated design simplifies the compressor system by eliminating the connection between the electric machine and compressor. Weight, volume, and cost savings are expected. The feasibility of the proposed concept is demonstrated by combining the principle knowledge in electric machine design and compressor design. The operating principles of this novel integrated machine are described in the paper. Analytical design methods are used to study the proposed integrated machine and compressor. Possible topology variations of the proposed concept are discussed.","autors":"Y. Li; D. Bobba; E. Schubert; H. Ding; B. Sarlioglu","citation-count":2.0,"id":"10.1109/ICELMACH.2016.7732623","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7732623","publication-year":"2016","title":"Novel permanent magnet machines with integrated fluid dynamic design for compression applications","topics":[{"affinity":0.6412270069122314,"id":0},{"affinity":0.35877302289009094,"id":1}]},{"abstract":"The insulation of a rotating electrical machine is a complex system. Predicting its lifetime is an extremely challenging task, as it involves elements of chemistry, material science and electrical engineering. This lifetime prediction/assessment, if performed under standard “in-service” operating conditions, can require months (and in some cases years) of testing. Therefore, accelerated lifetime tests, performed on suitable specimens, are conventionally run for fulfilling such task, as they reduce the total testing time. During these tests, the stress level applied to the examined system (i.e. insulation) is enhanced with respect to normal operating conditions, with the aim of reaching the end of life in a relatively short amount of time. It is thus of crucial importance selecting an appropriate specimen's typology, as the choice might strongly influence the tests' outcome. In this work, the accelerated thermal aging results for three different specimens' typologies, i.e. twisted pair, motorette and coil, are presented and apprised. The tests are carried out on a round enamelled magnet wire, to be employed for the winding of low voltage electrical machines. Among the three specimens, it is found that twisted pairs tend to largely over-estimate the thermal lifetime, with respect to both motorettes and coils.","autors":"V. Madonna; P. Giangrande; M. Galea","citation-count":null,"id":"10.1049/icp.2021.1127","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9545308","publication-year":"2020","title":"On specimens choice for thermal lifetime assessment of low voltage electrical machines insulation","topics":[{"affinity":0.006023329216986895,"id":0},{"affinity":0.9939766526222229,"id":1}]},{"abstract":"Multi-processing and multi-axis machines are mainstream products in the near future machine tool market. Due to the structural complexities, it is not easy to understand the physical phenomena related with the performance characteristics such as accuracy and speed. Structural parasitic motion occurring in a weak machine tool structure degrades the movement precision in such a manner that both the surface finish and contour of the workpiece are affected. Though increase in the number of controlled axes underlines a complex set of constraints in analysis and control, we can identify weak links and improve them with modern engineering tools. In some cases, embedded control function can be effectively used for automatically compensating mechanical defects. In this regard, some case studies will be presented from the recent experiences in the field of multi-processing and multi-axis machine tools.","autors":"T. Gim; C. -H. Lee; J. -Y. Ha; T. -H. Kim","citation-count":null,"id":"10.1109/ICSMA.2008.4505647","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4505647","publication-year":"2008","title":"Machine Tool Technologies for High Performance Machines","topics":[{"affinity":0.9902597665786743,"id":0},{"affinity":0.009740223176777363,"id":1}]},{"abstract":"This paper presents the creation of a set with appropriate web applications, using Matlab Web Apps. The set's aim is to ease the teaching process in distance learning for Engineering specialties in Electrical engineering. This set represents an adaptation of the existing test benches in the laboratory exercises of the discipline Electrical Machines part II, especially for the synchronous machines. The developed web applications propose a user-friendly and realistic user interface. The machines are modeled following the generalized theory of the electrical machines in the Matlab environment. The models are then transformed in web applications. The presented simulation and experimental results show good correspondence, which justify the applications' accuracy.","autors":"I. Bachev; L. Stoyanov; V. Petrov; E. Hadjiatanasova-Deleva","citation-count":4.0,"id":"10.1109/ELMA52514.2021.9503005","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9503005","publication-year":"2021","title":"Application of Synchronous Machines’ Models for Distance Learning Purposes","topics":[{"affinity":0.990243136882782,"id":0},{"affinity":0.00975686963647604,"id":1}]},{"abstract":"Permanent Magnet assisted Synchronous Reluctance Machines (PMaSynRM) received a growing interest in the past decade. They offer several advantages in comparison with other machine types, e.g.: Low rotor losses occur with respect to induction machines. The use of ferrite magnets avoids cost intensive rare-earth magnets in permanent magnet synchronous machines. The low power factor of a pure synchronous reluctance machine is increased. However, the PMaSynRM also causes iron losses which are difficult to determinate. This paper deals with the iron loss modeling as well as the choice of the current set points (operating strategy). The focus is on the analysis of the measurement results and the impact of the speed. The prototype includes a special ribless rotor which is characterized by low cross-coupling and a high magnetic anisotropy.","autors":"M. Zimmermann; L. Schupp; B. Piepenbreier","citation-count":null,"id":"10.23919/ICEMS.2018.8549285","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8549285","publication-year":"2018","title":"Operating Strategy and Iron Loss Model of a Permanent Magnet Assisted Synchronous Reluctance Machine with a Ribless Rotor","topics":[{"affinity":0.9885942935943604,"id":0},{"affinity":0.011405638419091702,"id":1}]},{"abstract":"Permanent magnet (PM) synchronous machines are becoming increasingly popular for a wide range of applications. This is mainly due to the significant advantages they provide in terms of power density and efficiency. One of the key challenges of using PM machines is fault-tolerance issue as the machine cannot be simply de-excited. This becomes even more important in safety-critical applications. The most severe and probable type of fault is the turn-to-turn fault. This paper provides a thorough analysis of turn-to-turn faults in surface PM machines with multi-layer fractional-slot concentrated windings. Different winding arrangements, and different slot/pole combinations are analyzed.","autors":"M. R. Shah; A. M. EL-Refaie; K. Sivasubramaniam","citation-count":3.0,"id":"10.1109/ICELMACH.2008.4799990","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4799990","publication-year":"2008","title":"Analysis of turn-to-turn faults in surface PM machines with multi-layer fractional-slot concentrated windings","topics":[{"affinity":0.012740707024931908,"id":0},{"affinity":0.9872593283653259,"id":1}]},{"abstract":"The pulse-width-modulated (PWM) current-source converters (CSCs) fed electric machine systems can be considered as a type of high reliability energy conversion systems, since they work with the long-life DC-link inductor and offer high fault-tolerant capability for short-circuit faults. Besides, they provide motor friendly waveforms and four-quadrant operation ability. Therefore, they are suitable for high-power applications of fans, pumps, compressors and wind power generation. The purpose of this paper is to comprehensively review recent developments of key technologies on modulation and control of high-power (HP) PWM-CSC fed electric machines systems, including reduction of low-order current harmonics, suppression of inductor-capacitor (LC) resonance, mitigation of common-mode voltage (CMV) and control of modular PWM-CSC fed systems. In particular, recent work on the overlapping effects during commutation, LC resonance suppression under fault-tolerant operation and collaboration of modular PMW-CSCs are described. Both theoretical analysis and some results in simulations and experiments are presented. Finally, a brief discussion regarding the future trend of the HP CSC fed electric machines systems is presented.","autors":"P. Liu; Z. Wang; S. Wei; Y. Bo; S. Pu","citation-count":null,"id":"10.30941/CESTEMS.2020.00027","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9211093","publication-year":"2020","title":"Recent developments of modulation and control for high-power current-source-converters fed electric machine systems","topics":[{"affinity":0.00869682151824236,"id":0},{"affinity":0.9913032054901123,"id":1}]},{"abstract":"This paper provides a review on the most recent applications of superconductors in rotating electrical machines. The main types of superconductors for the present-day electrical applications are shown to highlight their main features. The main characteristics of superconducting synchronous machines, DC machines and induction machines for marine and vehicle propulsion, future electric aircraft, wind energy and industrial applications are discussed by presenting data of prototypes and demonstrators. The paper aims to raise awareness among researchers and engineers on the importance of superconductivity to enhance the performance of conventional electrical machines.","autors":"M. Biasion; J. F. P. Fernandes; S. Vaschetto; A. Cavagnino; A. Tenconi","citation-count":4.0,"id":"10.1109/IEMDC47953.2021.9449545","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9449545","publication-year":"2021","title":"Superconductivity and its Application in the Field of Electrical Machines","topics":[{"affinity":0.7858694791793823,"id":0},{"affinity":0.21413050591945648,"id":1}]},{"abstract":"The hybrid-excited switched-flux permanent magnet machines (HESFPMMs) have the potential for many applications, such as electric vehicles and aerospace. However, in the flux weakening region, it is usually difficult to determine the excitation current, while the extra copper loss due to field excitation may cause significant reduction in the machine performance especially efficiency. Therefore, a new control strategy for the HESFPMMs, which can operate in both flux-enhancing and flux-weakening regions, has been proposed. It utilises a novel feature of HESFPMMs in which the flux produced by the permanent magnets can be inherently shortcircuited via the iron flux-bridges. Hence, in this proposed method, the field excitation current is set to zero in order to avoid the copper loss of the field winding in the flux weakening region. Meanwhile, it utilizes the voltage difference between the command and real voltages, and does not require the machine parameters to modify the excitation current reference in flux-enhancing mode and the d-axis current reference in flux-weakening mode. In addition, in order to improve the tracking accuracy of the excitation current, the current feedback control is employed. As a result, the proposed method can provide a smooth speed transition from flux-enhancing mode to flux-weakening mode. It is verified by the experiments and can also be implemented for other hybrid-excited machines.","autors":"N. Pothi; Z. Q. Zhu","citation-count":13.0,"id":"10.1049/cp.2014.0305","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6836931","publication-year":"2014","title":"A new control strategy for hybrid-excited switched-flux permanent magnet machines without the requirement of machine parameters","topics":[{"affinity":0.9936366677284241,"id":0},{"affinity":0.006363309919834137,"id":1}]},{"abstract":"High-power-density megawatt-scale surface permanent magnet (SPM) machines are strong candidates for future aircraft electric propulsion applications. Additional power density and fault tolerance benefits can be gained by designing the machine as an Integrated Modular Motor Drive (IMMD) that breaks the machine into multiple three-phase modules, each with its own dedicated power electronics. This paper discusses development of a 1 MW SPM machine for an IMMD configuration with a rated speed of 20,000 rev/min. A lower-power demonstrator version of this machine (200 kW) has been built to retire key technical risks and to validate machine models for the final design. The materials, components, and performance of this demonstrator machine are reviewed. The machine test configuration is described, and initial test results are presented that exhibit promising agreement with performance predictions provided by simulations and analytical models. Finally, fault tolerance benefits of the modular stator design are experimentally demonstrated.","autors":"J. Swanke; H. Zeng; D. Bobba; T. M. Jahns; B. Sarlioglu","citation-count":4.0,"id":"10.1109/IEMDC47953.2021.9449536","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9449536","publication-year":"2021","title":"Design and Testing of a Modular High-Speed Permanent-Magnet Machine for Aerospace Propulsion","topics":[{"affinity":0.02905334159731865,"id":0},{"affinity":0.9709466099739075,"id":1}]},{"abstract":"The permanent magnet synchronous machine with an external rotor is the most important device for high performance electrical drive systems in particular for hybrid electric vehicles. The paper discusses finite element analyses of such a machine with concentrated tooth coils in terms of a comparison of both Y- and Δ-connected stator windings. As the evolved electromagnetic torque is one of the most important design parameter, various ratios of tooth width and slot pitch are analyzed with the two connections of the stator winding. On the other hand, the phase voltages for various operating conditions are compared between both Y- and Δ-connected stator windings.","autors":"E. Schmidt; M. Sušić; A. Eilenberger","citation-count":3.0,"id":"10.1109/ICELMACH.2010.5608233","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5608233","publication-year":"2010","title":"Finite element analysis of an external rotor permanent magnet synchronous machine with star- and delta-connected tooth coil windings","topics":[{"affinity":0.9777463674545288,"id":0},{"affinity":0.02225363254547119,"id":1}]},{"abstract":"The Machine Type Communication Devices (MTCDs) are usually based on Internet Protocol (IP), which can cause billions of connected objects to be part of the Internet. The enormous amount of data coming from these devices are quite heterogeneous in nature, which can lead to security issues, such as injection attacks, ballot stuffing, and bad mouthing. Consequently, this work considers machine learning trust evaluation as an effective and accurate option for solving the issues associate with security threats. In this paper, a comparative analysis is carried out with five different machine learning approaches: Naive Bayes (NB), Decision Tree (DT), Linear and Radial Support Vector Machine (SVM), KNearest Neighbor (KNN), and Random Forest (RF). As a critical element of the research, the recommendations consider different Machine-to-Machine (M2M) communication nodes with regard to their ability to identify malicious and honest information. To validate the performances of these models, two trust computation measures were used: Receiver Operating Characteristics (ROCs), Precision and Recall. The malicious data was formulated in Matlab. A scenario was created where 50% of the information were modified to be malicious. The malicious nodes were varied in the ranges of 10%, 20%, 30%, 40%, and the results were carefully analyzed.","autors":"E. Eziama; L. M. S. Jaimes; A. James; K. S. Nwizege; A. Balador; K. Tepe","citation-count":4.0,"id":"10.1109/ISSPIT.2018.8705147","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8705147","publication-year":"2018","title":"Machine learning-based recommendation trust model for machine-to-machine communication","topics":[{"affinity":0.006059450097382069,"id":0},{"affinity":0.9939405918121338,"id":1}]},{"abstract":"This work is showing in detail the flux density behaviour in the stator teeth of a synchronous machine. A 3-phase Surface Permanent Magnet (SPM) motor is considered. These motors are widely employed in applications where high efficiency and power densities are required. This paper aims to analytically demonstrate the asymmetrical distribution of the stator teeth flux density. It is shown that this phenomena is depending on the number of slots per pole and per phase in the machine. Finally, a comparison with Finite Element results is given to validate the effectiveness of the proposed model.","autors":"G. Sala; D. D. Gaetano; M. Degano; C. Gerada","citation-count":1.0,"id":"10.1109/WEMDCD.2019.8887831","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8887831","publication-year":"2019","title":"Asymmetrical Flux Density Distribution in Stator Teeth of Surface Permanent Magnet Machines","topics":[{"affinity":0.7545810341835022,"id":0},{"affinity":0.2454189956188202,"id":1}]},{"abstract":"Hybrid micro machine tools are increasingly in demand for manufacturing microproducts made of hard-to-machine materials, such as ceramic air bearing, bio-implants and power electronics substrates etc. These machines can realize hybrid machining processes which combine one or two non-conventional machining techniques such as EDM, ECM, laser machining, etc. and conventional machining techniques such as turning, grinding, milling on one machine bed. Hybrid machine tool developers tend to mix and match components from multiple vendors for the best value and performance. The system integrity is usually at the second priority at the initial design phase, which generally leads to very complex and inflexible system. This paper proposes a reconfigurable control software, architecture for a hybrid micro machine tool, which combines laser-assisted machining and 5-axis micro-milling as well as incorporating a material handling system and advanced on-machine sensors. The architecture uses finite state machine (FSM) for hardware control and data flow. FSM simplifies the system integration and allows a flexible architecture that can be easily ported to similar applications. Furthermore, component-based technology is employed to encapsulate changes for different modules to realize “plug-and-play”. The benefits of using the software architecture include reduced lead time and lower cost of development.","autors":"W. Zhong; W. Chang; L. Rubio; X. Luo","citation-count":null,"id":"10.1109/IConAC.2015.7313994","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7313994","publication-year":"2015","title":"Reconfigurable software architecture for a hybrid micro machine tool","topics":[{"affinity":0.9936867356300354,"id":0},{"affinity":0.006313243880867958,"id":1}]},{"abstract":"One main target in modern design of mobile working machines is the reduction of hydraulic oil in the on board actuator systems. This results in making the systems more environmentally friendly and leads to the idea of replacing the hydraulic actuators by electric actuators. Here this approach is presented by implementing electrical tubular linear actuators in a sickle bar, which is coupled with a mass-spring-system. To gain maximum energy efficiency the actuator is operated in resonance. By considering the limited construction space and the resonance operation, an electric machine with large force density and small force ripple is required. The requirement of large force density leads to the selection of a tubular machine fitted with permanent magnets in the moving part. It works with a 3-phase winding of maximum winding factor and the electromagnetic design results in a mover with flux-collecting effect. To fulfill the requirement of small force ripple over the whole operation range, the technique of axial skew (pole shift) is implemented and analyzed via simulation.","autors":"M. Cai; Q. Maurus; M. Henke","citation-count":1.0,"id":"10.1109/IEMDC.2017.8002260","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8002260","publication-year":"2017","title":"Tubular PM machine with large force density and small force ripple for resonance operation","topics":[{"affinity":0.008048254996538162,"id":0},{"affinity":0.9919517040252686,"id":1}]},{"abstract":"Support vector machine (SVM) is a novel type learning machine, based on statistical learning theory. Due to the good generalization capability, SVMs have been widely used in classification, regression and pattern recognition. In this paper, for the data with numerical condition attributes and decision attributes, a new fuzzy classification method (FCM) based on SVM is proposed. This method first fuzzifies decision attributes to some classes (linguistic terms), then trains decision function (classifier). For a new sample, the decision function doesn't forecast the value of its decision attribute, but gives the corresponding class and its membership degree as fuzzy decision. This fuzzy decision result is more objective and easier to understand than crisp decision in common sense. The design principle is given and the classification algorithm is implemented in this paper. The experimental results show that the new method proposed in this paper is effective. The method optimizes the classified result of common SVMs, and therefore enhances the intelligent level of SVMs.","autors":"Qiang He; Xi-Zhao Wang; Hong-Jie Xing","citation-count":null,"id":"10.1109/ICMLC.2003.1259676","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1259676","publication-year":"2003","title":"A fuzzy classification method based on support vector machine","topics":[{"affinity":0.9929147362709045,"id":0},{"affinity":0.007085294928401709,"id":1}]},{"abstract":"This paper analyzes different electric machines considering sustainable and resource-efficient production using a life cycle assessment (LCA) in the European area (RER) and in the rest of the world area (RoW). Four machines are considered, the induction machine (IM), the externally excited synchronous machine (EESM), the permanent magnet synchronous machine (PMSM), and the synchronous reluctance machine (SynRM), each with an output power of 100 kW. This paper examines these three-phase machines on the basis of their material composition and classifies their needs for raw materials into critical and non-critical materials. The researchers used the Umberto LCA+ program to simulate a LCA for each machine based on the ReCiPe method and to calculate each machine's global warming potential (GWP). The ReCiPe method shows the damage caused during manufacturing to ecosystem quality, human health, and resource availability The GWP method maps the effect of individual manufacturing phases on emissions of CO2 and other greenhouse gases. The researchers' methodology yielded an overall environmental impact for each machine in its each of its individual manufacturing phases.","autors":"H. Schillingmann; S. Gehler; M. Henke","citation-count":null,"id":"10.1109/EDPC53547.2021.9684195","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9684195","publication-year":"2021","title":"Life cycle assessment of electrical machine production considering resource requirements and sustainability","topics":[{"affinity":0.006960994563996792,"id":0},{"affinity":0.9930390119552612,"id":1}]},{"abstract":"This paper extends the stationary reference frame of P.C. Krausse et al. (1995), to the modeling and analysis of the torque behavior of a two-phase unsymmetrical induction machine with a shifted auxiliary winding. By computer simulation, compared with experimental results, the influence of the electrical auxiliary phase stator shift over the machine's torque and currents is verified. The analysis is made for steady-state and transient state operation. The two-phase induction machine (TPIM) is widely used in many light-duty applications where three-phase supply is not readily available. During the development of such a machine, there are several options, including the spatial placement of the auxiliary winding. The torque-slip characteristics can be manipulated by shifting the auxiliary winding from the quadrature position. The analysis of the single-phase or two-phase induction machine with a shifted auxiliary winding was made by including time domain equivalent circuit, symmetrical components, or multiple reference frames. The first two methods are acceptable for analyzing the steady-state performance of the machine, while the third method involves too many equations and variables in order to describe the dynamic performance of the TPIM.","autors":"M. Popescu; E. Demeter; T. Jokinen; V. Navrapescu","citation-count":5.0,"id":"10.1109/IEMDC.1999.769123","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=769123","publication-year":"1999","title":"Modeling and analysis of a two-phase induction machine with nonorthogonal stator windings","topics":[{"affinity":0.9931986331939697,"id":0},{"affinity":0.006801366340368986,"id":1}]},{"abstract":"Double excitation synchronous machines combine permanent-magnet (PM) excitation with wound field excitation. The goal behind the principle of double excitation is to combine the advantages of PM-excited machines and wound field synchronous machines. These machines can constitute an energy-efficient solution for vehicle propulsion. This paper presents a comparison of the open circuit flux control capability of two structures of double excitation synchronous machines. First, a review of the state of the art of double excitation machines is presented. Then, the structures of these two machines are presented: one is a series double excitation synchronous machine and the other is a parallel double excitation synchronous machine. Finally, the open circuit flux control capabilities of both structures are compared.","autors":"Y. Amara; S. Hlioui; R. Belfkira; G. Barakat; M. Gabsi","citation-count":49.0,"id":"10.1109/TVT.2011.2173704","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6061975","publication-year":"2011","title":"Comparison of Open Circuit Flux Control Capability of a Series Double Excitation Machine and a Parallel Double Excitation Machine","topics":[{"affinity":0.011847076006233692,"id":0},{"affinity":0.9881529211997986,"id":1}]},{"abstract":"In the following investigation the modeling and control strategy of a doubly fed induction machine is discussed for power production/electric propulsion purposes, when being incorporated as a shaft generator into a ship's system. When the doubly fed induction machine serves as a power production machine, contributes to lower emission of CO2 and fuel saving. This is due to the fact that the doubly fed induction machine is capable of working at different speed (lower) than synchronous. This coincide with the enforcement with which the International Maritime Organization (IMO) and the EU demand reduction of Ship's emissions. The system of the doubly fed induction machine is being controlled by implementing a practical form of a vector control technique which has been previous developed in the case of the control of variable speed wind energy systems. The electrical torque of the double fed induction machine is regulated to be constant and the doubly fed induction machine is allowed to perform within the range of zero to the twice of the synchronous speed. The relevant results demonstrate a very good regulation of the speed at various operational points either as in the motor or the generator mode.","autors":"J. C. Dermentzoglou","citation-count":3.0,"id":"10.1109/ICELMACH.2014.6960509","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6960509","publication-year":"2014","title":"Investigating the incorporation of a doubly fed induction machine as a shaft generator into a ship's system: Application of a vector control scheme for controlling the doubly fed induction machine","topics":[{"affinity":0.8526301980018616,"id":0},{"affinity":0.14736980199813843,"id":1}]},{"abstract":"Access to machine data, e.g. axis positions inside an AR maintenance application can potentially increase the usefulness of AR in maintenance. Technicians walking to the machine control for looking up information would be avoided. However, the machine control interface and data are machine manufacturer depended, making it necessary to customize the interface between the machine control and the AR maintenance application. Here, we present a solution integrating machine control access from three different machines using a middleware box. A qualitative assessment with technicians confirms the usefulness direct machine data access from an AR maintenance application.","autors":"M. Lorenz; S. Shandilya; S. Knopp; P. Klimant","citation-count":null,"id":"10.1109/VRW52623.2021.00180","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9419304","publication-year":"2021","title":"Industrial Augmented Reality: Connecting Machine-, NC- and Sensor-Data to an AR Maintenance Support System","topics":[{"affinity":0.010677771642804146,"id":0},{"affinity":0.9893222451210022,"id":1}]},{"abstract":"For electromagnetic actuators whose magnetic fields are three-dimensional, the use of the 3D finite element (FE) method is required. On the other hand, 3D FE analysis is expensive in computation time, especially for high power machines involving potentially high numbers of nodes. In this paper, a 3D reluctance network (RN) modeling approach is proposed for the pre-design of permanents magnets synchronous machines (PMSM). The RN model developed is used to model three types of electrical machines (linear machine, radial field rotating machine and axial field rotating machine). Our goal is to establish lightweight models for the pre-design of electrical machines. The performances (local and global quantities) of these machines are evaluated using this 3D RN modeling. The results obtained from this approach are validated by comparison with results issued from the 3D FE analyses.","autors":"A. A. Diriye; Y. Amara; G. Barakat","citation-count":5.0,"id":"10.1109/ICELMACH.2018.8506820","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8506820","publication-year":"2018","title":"Three-Dimensional Modeling of Permanents Magnets Synchronous Machines Using a 3D Reluctance Network","topics":[{"affinity":0.011597590520977974,"id":0},{"affinity":0.9884024262428284,"id":1}]},{"abstract":"Induction machines are commonly used in traction applications due to their robustness and lower production costs when compared to the Permanent Magnet Synchronous Motor (PMSM). In such traction applications, the induction machines are mainly operated by field oriented control. This control technique requires an accurate knowledge of the machine's parameters. The accuracy of the parameters influence the precision of the calculated rotor flux and its angle and the decoupling of the machine's equation into the direct and quadrature coordinate system (dq-components). Furthermore, the parameters can be used to configure the controllers of the field-oriented control system and therefore have an influence on the dynamic behavior and stability of the control. In this paper we will discuss, analyze and compare different methods to calculate the machine's parameters in an automated and rapid procedure with minimal measuring expenditure. Moreover, a method to configure a control that reduces the overall Ohmic losses of the machine in every point of operation will be presented and analyzed.","autors":"M. Nell; G. von Pfingsten; K. Hameyer","citation-count":null,"id":"10.1109/ISEF.2017.8090672","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8090672","publication-year":"2017","title":"Approach for the rapid characterization and control of an induction machine","topics":[{"affinity":0.010082907043397427,"id":0},{"affinity":0.9899170994758606,"id":1}]},{"abstract":"This paper presents an equivalent circuit of doubly-fed brushless reluctance machine (DFRM) based on frequency referring, which solves the problem that vectors relative to the power winding and control winding are not stationary each other. The proposed equivalent circuit makes the relationship between the main winding and control winding clear and easy to be used for analysis of the steady state behavior of a DFRM. The application example and simulation results of the equivalent circuit are presented in the paper.","autors":"Wang Zheng; Wang Fengxiang; Zhang Fengge","citation-count":1.0,"id":"10.1109/ICEMS.2005.202600","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1574833","publication-year":"2005","title":"Study on equivalent circuit of doubly fed brushless reluctance machine based on frequency referring","topics":[{"affinity":0.9837602972984314,"id":0},{"affinity":0.016239678487181664,"id":1}]},{"abstract":"Classification of objects has been a significant area of concern in machine vision applications. In recent years, Support Vector Machines (SVM) is gaining popularity as an efficient data classification algorithm and is being widely used in many machine vision applications due to its good data generalization performance. The present paper describes the development of multi-class SVM classifier employing one-versus-one max-wins voting method and using Radial Basis Function (RBF) and Linear kernels. The developed classifiers have been applied for color-based classification of apple fruits into three pre-defined classes and their performance is compared with conventional K-Nearest Neighbor (KNN) and Naïve Bayes classifiers. The multi-class SVM classifier with RBF kernel has shown superior classification performance.","autors":"J. Suriya Prakash; K. Annamalai Vignesh; C. Ashok; R. Adithyan","citation-count":13.0,"id":"10.1109/MVIP.2012.6428794","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6428794","publication-year":"2012","title":"Multi class Support Vector Machines classifier for machine vision application","topics":[{"affinity":0.39461836218833923,"id":0},{"affinity":0.6053816080093384,"id":1}]},{"abstract":"A comparative analysis of the performance of a Reconfigurable Multifunctional Machine Tool (RMMT) has been performed compared to conventional machining by various specialized Machine Tools (machining centers, lathes, grinding machines, etc.). Using a practical example, it is shown that production cost by RMMT is about 33% lower and productivity is about 1.7 times higher than the basic variant (three machine tools).","autors":"S. Guergov","citation-count":3.0,"id":"10.1109/CREBUS.2019.8840054","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8840054","publication-year":"2019","title":"Comparative Analysis for the Economic Efficiency of the Reconfigurable Multifunctional Technological Machines in Small and Medium-sized Enterprises Environment","topics":[{"affinity":0.20754189789295197,"id":0},{"affinity":0.7924581170082092,"id":1}]},{"abstract":"The effect of electromagnetic and mechanical characteristics in permanent magnet (PM) synchronous machines on noise and vibration is presented. Some mechanisms of electromagnetic and mechanical interaction of the machine resulting in noise and vibration are analyzed and calculated. Computational and experimental results are also compared. Noise and vibration resulting from electromagnetic forces dominates in the noise and vibration of PM electrical machine on rated load. When the exerting force frequencies coincide with modal frequencies of the stator, the motor can generate high noise and vibration peak.","autors":"Shenbo Yu; Renyuan Tang","citation-count":84.0,"id":"10.1109/TMAG.2006.871637","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1608461","publication-year":"2006","title":"Electromagnetic and mechanical characterizations of noise and vibration in permanent magnet synchronous machines","topics":[{"affinity":0.01251208782196045,"id":0},{"affinity":0.9874879121780396,"id":1}]},{"abstract":"It is a general perception that the interior permanent magnet machines will have different values of inductances along d-axis and q-axis and hence they are salient pole machines. Though it is true in most of the cases, some interior permanent magnet machines may turn out to be non-salient pole machines. Hence an accurate modeling of magnetic equivalent circuit is very much required in order to estimate the inductance values along d-axis and q-axis. A hybrid excitation machine with an interior configuration of permanent magnets and field winding is proposed in the literature. Though it appears to be a salient pole machine from rotor configuration view point, the actual analytical inductance analysis on this machine proves that it is a non-salient pole machine. A simpler analytical approach is carried out through approximate linear magnetic equivalent circuit. The analytical analysis is validated with analysis carried out through FEM software.","autors":"U. K. Mudhigollam; U. Choudhury; K. Hatua","citation-count":null,"id":"10.1109/PEDES.2018.8707868","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8707868","publication-year":"2018","title":"Non-Saliency of Interior Permanent Magnet Hybrid Excitation Machine","topics":[{"affinity":0.9888919591903687,"id":0},{"affinity":0.011108018457889557,"id":1}]},{"abstract":"In recent years, electrical machines are employed in an ever-increasing number of safety-critical applications, which require high power density, along with a demanding level of reliability and/or fault-tolerance capability. Multi-phase machines are generally considered a suitable option for satisfying these constraints. Among them, the dual three-phase configuration claims the additional benefit of being operated through conventional power electronics converters and control strategies. Despite the undeniable advantages and their wide diffusion, the thermal modelling of dual three-phase machines still represents an open research topic. Thus, this paper proposes the thermal analysis of a dual three-phase permanent magnet synchronous machine, highlighting the thermal coupling between the two winding sets. An experimentally fine-tuned lumped parameter thermal network is initially presented. Then, due to its relatively high number of nodes, a reduced order thermal network using only 3 nodes is developed. Finally, both thermal networks are examined and compared under several load conditions, in terms of accuracy and computational burden.","autors":"P. Giangrande; V. Madonna; S. Nuzzo; C. Spagnolo; C. Gerada; M. Galea","citation-count":9.0,"id":"10.1109/WEMDCD.2019.8887772","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8887772","publication-year":"2019","title":"Reduced Order Lumped Parameter Thermal Network for Dual Three-Phase Permanent Magnet Machines","topics":[{"affinity":0.8586640357971191,"id":0},{"affinity":0.14133600890636444,"id":1}]},{"abstract":"This paper presents experimental and theoretical research on noise and vibration characteristics of a large-capacity permanent magnet synchronous machine. Some mathematical models of noise control of electromagnetic, aerodynamic and mechanical origins are established and applied to the machine design.","autors":"Yu Shenbo; Zhao Qing; Tang Renyuan","citation-count":null,"id":"10.1109/ICEMS.2001.971809","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=971809","publication-year":"2001","title":"Researches on noise and vibration characteristics of large-capacity permanent magnet synchronous machine","topics":[{"affinity":0.025806836783885956,"id":0},{"affinity":0.9741932153701782,"id":1}]},{"abstract":"For the coupled electromagnetic and structure-dynamic simulation of electrical machines, various 2D and 3D techniques are available. This paper reviews and compares them. The strength as well as the weaknesses of these methods are pointed out. Numerical results for the analysis of a switched reluctance machine (SRM) as an example evaluate accuracy and computational effort. It shows that the 2D simulation gives quite accurate results, as long as the axial effects and 3D mode shapes are not relevant.","autors":"M. van der Giet; C. Schlensok; B. Schmulling; K. Hameyer","citation-count":20.0,"id":"10.1109/TMAG.2007.916121","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4527015","publication-year":"2008","title":"Comparison of 2-D and 3-D Coupled Electromagnetic and Structure-Dynamic Simulation of Electrical Machines","topics":[{"affinity":0.9737816452980042,"id":0},{"affinity":0.026218367740511894,"id":1}]},{"abstract":"Based on the analysis and minimization of current harmonics in the synchronous reference frame under steady state, a simple machine-parameter-independent dead time compensation method is presented for permanent magnet synchronous machine drives. It has the advantage of simple signal processing algorithms. Compared with the existing current harmonic analysis methods based on the integrator output of the current harmonics, which can only use the d-axis current, the proposed method can use either the d-axis or q-axis currents to generate the precise compensation voltages. Further, the proposed method does not rely on operating conditions. Its effectiveness is verified by experimental results.","autors":"L. Wang; Z. Q. Zhu; B. Hong; L. Gong","citation-count":null,"id":"10.1049/icp.2021.0939","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9545360","publication-year":"2020","title":"A SIMPLE CURRENT HARMONIC ANALYSIS BASED DEAD TIME COMPENSATION METHOD FOR PERMANENT MAGNET SYNCHRONOUS MACHINE DRIVES","topics":[{"affinity":0.9876246452331543,"id":0},{"affinity":0.012375369668006897,"id":1}]},{"abstract":"Data mining in the CRM aiming at learning available knowledge from the customer relationship by machine learning or statistical method to instruct the strategic behavior so that obtain the most profit. In recent years, Support vector machine (SVMs) has been proposed as a power tool in machine leaning and data mining. This paper applies the SVMs to resolve the practical CRM problem in a company. The final results report the good general performance of SVMs for CRM problem.","autors":"B. Liu; Z. -F. Hao; J. Lu; S. -Q. Liu","citation-count":2.0,"id":"10.1109/ICMLC.2007.4370715","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4370715","publication-year":"2007","title":"Apply Support Vector Machine for CRM Problem","topics":[{"affinity":0.1646299958229065,"id":0},{"affinity":0.8353699445724487,"id":1}]},{"abstract":"When feasible, testing high power synchronous machines in a classical steady state regime requires a great deal of electrical power. This paper presents a method and its implementation for testing electrical machines in transient regimes, aiming at the reduction of the required power and minimization of the testing time. The direct-axis and quadrature-axis reactances are indirectly found by processing the acquired digitized samples of the step response of the stator current of a locked-rotor synchronous machine. Experimental results that have been obtained in a series of formal tests, illustrates the large applicability of this method.","autors":"V. Z. Groza; M. Biriescu; G. Liuba","citation-count":1.0,"id":"10.1109/IEMDC.1999.769062","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=769062","publication-year":"1999","title":"Measurement of reactance of synchronous machines at standstill","topics":[{"affinity":0.9811870455741882,"id":0},{"affinity":0.018812978640198708,"id":1}]},{"abstract":"A detailed investigation of different pole shapes of a flux switching machine with a large air-gap (δ = 3 mm) compared to the machines outer diameter (Dsa = 100 mm) is conducted by means of 2D finite element analysis. The rotor pole shape as well as the stator core is modelled using parametrized spline curves to improve the electromagnetic performance of the FSPM machine. During the design process, the main governing parameters of the machine are kept constant except the number of turns per phase which is adapted to the actual slot area. Additionally, an alternative optimization method is implemented using a combination of several parts of wellknown optimization algorithms and chaotic parameter generation. It is shown, that the proposed method is capable to increase the torque of the machine by more than 12 % which is in general not an easy task for this small machine.","autors":"A. Lindner; H. Kurtović; I. Hahn","citation-count":7.0,"id":"10.1049/cp.2016.0318","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7739506","publication-year":"2016","title":"Investigation of parametrized curves for the pole shaping in an E-core Flux-Switching Machine with large air-gap","topics":[{"affinity":0.9894691705703735,"id":0},{"affinity":0.010530817322432995,"id":1}]},{"abstract":"Modelling of AC electrical machines plays an important role in electrical engineering education related to electrical machine design and control. One of the fundamental requirements in AC machine modelling is to derive the self and mutual inductances, which could be position dependant. Theories developed so far for inductance determination are often associated with complicated machine magnetic field analysis, which exhibits a difficulty for most students. This paper describes a simple and general approach to the determination of self and mutual inductances of different types of AC machines. A new vector projection method is proposed. In this method, integration of the magnetic field may simply be replaced by vector projection of the field vector. Inductance may then be obtained by observing the magnetic field axes and the phase winding axes. Examples of applying the proposed method for inductance determination are given for a 3-phase, salient-pole synchronous machine, and an induction machine.","autors":"K. Lu; P. O. Rasmussen; E. Ritchie","citation-count":2.0,"id":"10.1109/ICEMS.2011.6073349","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6073349","publication-year":"2011","title":"A simple and general approach to determination of self and mutual inductances for AC machines","topics":[{"affinity":0.9927685856819153,"id":0},{"affinity":0.007231415715068579,"id":1}]},{"abstract":"This paper investigates the performance of large-airgap high-speed permanent magnet machines for the flywheel energy storage system. The high-speed electric machine in the flywheel energy storage system is placed in a vacuum chamber, and the heat dissipation of the electric machine becomes a key problem in the design of the high-speed permanent magnet machine. This paper investigates the relationship between components of the electric machine loss and electric machine parameters such as airgap length and slot-opening width, and proposes a new type of high-speed permanent magnet machine structure, which can reduce the eddy current loss of the rotor and improve the heat dissipation condition of the stator. According to the FEA results, it can be known that the large-airgap high-speed permanent magnet machine has better heat dissipation performance, which is beneficial to further improve the power level of the flywheel energy storage system.","autors":"Z. -f. Hong; Z. -y. Cheng; Y. -c. Wang","citation-count":1.0,"id":"10.23919/ICEMS50442.2020.9291220","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9291220","publication-year":"2020","title":"Large-Airgap High-Speed Permanent Magnet Machines for Flywheel System Applications","topics":[{"affinity":0.7905095219612122,"id":0},{"affinity":0.20949050784111023,"id":1}]},{"abstract":"Electrical machines are progressively being employed in an ever-increasing number of safety-critical applications (e.g. aerospace and automotive), which demand high performance as well as reliability features. The modular structure and the inherent winding redundancy of dual three-phase machines are noticeable attributes that make these fault-tolerant machines particularly suitable for safety-critical applications. However, conventional thermal networks might produce misleading results, when applied to dual three-phase machines. Indeed, they generally neglect the thermal mutual coupling between windings belonging to different phase sets, since only a single slot is modelled. This paper addresses the aforementioned issue by presenting two lumped parameters thermal networks (second- and third-order), which account for the thermal behavior of both winding sets. The proposed thermal networks are experimentally validated and between them, the third-order one is chosen as best candidate for predicting the windings' temperature, due to its simplicity, accuracy and fast computational time.","autors":"P. Giangrande; V. Madonna; W. Zhao; Y. Wang; C. Gerada; M. Galea","citation-count":null,"id":"10.1109/ICEMS.2019.8922309","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8922309","publication-year":"2019","title":"Simplified Lumped Parameter Thermal Network for Short-Duty Dual Three-Phase Permanent Magnet Machines","topics":[{"affinity":0.30859246850013733,"id":0},{"affinity":0.6914075016975403,"id":1}]},{"abstract":"This paper presents an analytical approach of the frequency response for the wound rotor induction machine as a possible method for fault diagnosis. This approach is based on mmf, flux and emf computation for both healthy and faulty machines during any operating condition. The proposed technique is applied to study the effect of opening one phase either on stator or rotor sides. The computed harmonics of both stator and rotor currents are experimentally verified on a test-bed based on a small power wound rotor induction machine.","autors":"H. Henao; C. Martis; G. A. Gapolino","citation-count":5.0,"id":"10.1109/DEMPED.2005.4662535","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4662535","publication-year":"2005","title":"Analytical approach of the frequency response for the wound rotor induction machine for diagnosis purpose","topics":[{"affinity":0.9861130118370056,"id":0},{"affinity":0.013886980712413788,"id":1}]},{"abstract":"This paper investigates the antidemagnetization capability of IPM machines with two winding types: fractional slot concentrated winding (FSCW) and integral slot distributed winding (ISDW). Based on the finite element method, anti-demagnetization capability with different winding types is compared. Three different rotor topologies of IPM machines are studied. The analysis results show that ISDW machines have better anti-demagnetization capability. For the FSCW machines, UV shape rotor can improve the anti-demagnetization capability.","autors":"S. Chen; C. -Y. Hsiao; L. Yao; F. Yu; Y. Wang; J. -X. Shen","citation-count":null,"id":"10.23919/ICEMS50442.2020.9291048","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9291048","publication-year":"2020","title":"Comparative Analysis of Magnet Demagnetization in FSCW and ISDW IPM Machines with Various Rotor Topologies","topics":[{"affinity":0.9850707054138184,"id":0},{"affinity":0.014929309487342834,"id":1}]},{"abstract":"In real-time video mining applications it is desirable to extract information about human subjects, such as gender, ethnicity, and age, from grayscale frontal face images. Many algorithms have been developed in the machine learning, statistical data mining, and pattern classification communities that perform such tasks with remarkable accuracy. Many of these algorithms, however, when implemented in software, suffer poor frame rates due to the amount and complexity of the computation involved. This paper presents an FPGA friendly implementation of a Gaussian Radial Basis SVM well suited to classification of grayscale images. We identify a novel optimization of the SVM formulation that dramatically reduces the computational inefficiency of the algorithm. The implementation achieves 88.6% detection accuracy in gender classification which is to the same degree of accuracy of software implementations using the same classification mechanism.","autors":"K. Irick; M. DeBole; V. Narayanan; A. Gayasen","citation-count":33.0,"id":"10.1109/FCCM.2008.40","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4724927","publication-year":"2008","title":"A Hardware Efficient Support Vector Machine Architecture for FPGA","topics":[{"affinity":0.9905750155448914,"id":0},{"affinity":0.009424972347915173,"id":1}]},{"abstract":"The reliability evaluation indices of computer numerical control (CNC) machine tool system have many levels and characteristics. In this paper, the CNC machine tool system is regarded as man-machine system. And the fuzzy comprehensive evaluation method is used to consider the influence of the reliability of the CNC machine tools and the operators on the system reliability. First, an evaluation index system is established and the criteria layer and the indicator layer are determined. Then, the weights of the indicators at each level are calculated by expert scoring. And finally, a comprehensive evaluation score is obtained through step-by-step evaluation. Taking JW4050AL machining center as an example, the results show that the reliability of this type of machine tool is at a high level, which is consistent with the actual situation. The results show that this method is suitable for the reliability evaluation of CNC machine tools.","autors":"W. Dai; J. Sun","citation-count":4.0,"id":"10.1109/ICRMS.2018.00083","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8718921","publication-year":"2018","title":"Research on Reliability Evaluation of Computer Numerical Control Machine Tool System Based on Man-Machine System","topics":[{"affinity":0.00939222238957882,"id":0},{"affinity":0.9906077980995178,"id":1}]},{"abstract":"Abrasive machining is commonly defined as a process to remove material by the action of sharp grain of abrasive mineral in order to obtain a final desired shape and surface quality. Therefore, it is considered one of the most important processes in the wood industry. The use of simulation on the most critical process in the wood industry would definitely help to obtain a better understanding of the processes and the effect of changes such as equipments, operators, and raw material, as well as others in the processes. The objective of this research is to simulate an abrasive machine commonly used in wood machining to have a better understanding of the behavior of the main variables that significantly affect the sanding process when change in time. The model uses a large amount of equations (650f) to predict the behavior of the abrasive process. Moreover, the model not only integrates continuous and discrete simulation, but also, it can be interactive (the operator learning curve can be introduced into the model), and includes stochastic considerations in operation time, maintenance, repairs, etc.","autors":"H. Gasparin; D. Saloni; R. Lemaster","citation-count":null,"id":"10.1109/IEEM.2007.4419511","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4419511","publication-year":"2007","title":"Abrasive process machine simulation model, a discrete and continuous approach","topics":[{"affinity":0.9910306930541992,"id":0},{"affinity":0.008969325572252274,"id":1}]},{"abstract":"An often-overlooked aspect during the development process of electrical machines is the validity and accuracy of the machine material properties being used at the design stage. Designers usually consider the data provided by the material supplier, which are measured on material in an unprocessed state. However, the fact that the machining processes required to produce the finished product (e.g., the stator core) can permanently vary the material properties is very often neglected. This paper, therefore, deals with and investigates the effects that such processes can have on the overall machine performance. To do this, three sets of material data, the material suppliers' data, material data based on conventional characterization methods, and material data based on test samples that include the manufacturing processes, are used to develop three versions of the same baseline machine. The results of these three machines are then compared, and the resulting variations of the machine's performance are presented and described. The chosen baseline machine is a high-performance and relatively high speed, aerospace, electrical machine. Special attention is focused on the efficiency maps of the machine, as this aspect is highly dependent on the material properties that are the most sensitive to manufacturing processes such as the material's anhysteretic B-H curve and its specific core loss.","autors":"A. Al-Timimy; G. Vakil; M. Degano; P. Giangrande; C. Gerada; M. Galea","citation-count":34.0,"id":"10.1109/TEC.2018.2808041","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8295137","publication-year":"2018","title":"Considerations on the Effects That Core Material Machining Has on an Electrical Machine's Performance","topics":[{"affinity":0.006704638712108135,"id":0},{"affinity":0.9932953715324402,"id":1}]},{"abstract":"This document reviews the current state of the art in the linear machine technology. First, the recent advancements in linear induction, switched reluctance and permanent magnet machines are presented. The ladder slit secondary configuration is identified as an interesting configuration for linear induction machines. In the case of switched reluctance machines, the mutually-coupled configuration has been found to equate the thrust capability of conventional permanent magnet machines. The capabilities of the so called linear primary permanent magnet, viz. switched-flux, flux-reversal, doubly-salient and vernier machines are presented afterwards. A guide of different options to enhance several characteristics of linear machines is also listed. A qualitative comparison of the capabilities of linear primary permanent magnet machines is given later, where linear vernier and switched-flux machines are identified as the most interesting configurations for long stroke applications. In order to demonstrate the validity of the presented comparison, three machines are selected from the literature, and their capabilities are compared under the same conditions to a conventional linear permanent magnet machine. It is found that the flux-reversal machines suffer from a very poor power factor, whereas the thrust capability of both vernier and switched-flux machines is confirmed. However, the overload capability of these machines is found to be substantially lower than the one from the conventional machine. Finally, some different research topics are identified and suggested for each type of machine.","autors":"I. Eguren; G. Almandoz; A. Egea; G. Ugalde; A. J. Escalada","citation-count":10.0,"id":"10.1109/ACCESS.2019.2961758","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8939403","publication-year":"2020","title":"Linear Machines for Long Stroke Applications—A Review","topics":[{"affinity":0.006484914105385542,"id":0},{"affinity":0.9935150742530823,"id":1}]},{"abstract":"This paper firstly analyses the actual underwriting methods of Chinese life insurance companies, and points out the merits and shortcomings of these methods. Then the incomplete database of insurance company is mined by the data mining's association rule algorithm. Thirdly the support vector machine (SVM) is applied to the underwriting process to classify the applicants. Finally the directions for improving this algorithm are pointed out. The algorithm proposed in this paper has promising future in underwriting process.","autors":"Yi Tan; Guo-Ji Zhang","citation-count":7.0,"id":"10.1109/ICMLC.2005.1527552","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1527552","publication-year":"2005","title":"The application of machine learning algorithm in underwriting process","topics":[{"affinity":0.9824161529541016,"id":0},{"affinity":0.017583850771188736,"id":1}]},{"abstract":"In this paper, the characteristic of interior permanent magnet synchronous machine (IPMSM) with concentrated windings is evaluated for three different rotor geometries. The reference machine is a fractional horsepower IPMSM with single-layer magnets (1-layered IPMSM). The maximum output power of the machine is 820 W. Based on the electrical properties and machine cost of the reference machine, IPMSM with two different rotor geometries are designed. The first one is an IPMSM with v-shaped magnets (VPMSM) and the second is an IPMSM with double-layer magnets topology (2-layered IPMSM). The machines are compared in two operating points: one in the base speed area and one in the field weakening range. The focus of the machine comparison are the parasitic effects due to the non-sinusoidal rotor field, e.g. back-emf harmonics, torque harmonics, radial force densities and iron losses.","autors":"A. K. Putri; M. Hombitzer; D. Franck; K. Hameyer","citation-count":3.0,"id":"10.1109/ICELMACH.2016.7732714","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7732714","publication-year":"2016","title":"Cost-oriented design of high speed low power interior permanent magnet synchronous machines","topics":[{"affinity":0.01219181064516306,"id":0},{"affinity":0.9878082275390625,"id":1}]},{"abstract":"Variable frequency transformer (VFT) has been recently used as an alternative to HVDC to control power flow between asynchronous networks. VFT consumes less reactive power than a back-to-back HVDC system, provides faster initial transient recovery, and has better natural damping capability. VFT is simply a doubly-fed induction machine (DFIM) where the machine torque controls the power flow from stator to rotor and vice versa. The main disadvantage of this VFT is the slip rings and brushes required for the rotor circuit, especially in bulk power transmission. The brushless doubly fed machine (BDFM) with nested cage rotor machine is proved to be a comparable alternative to conventional DFIM in many applications with the advantage that all windings being in the stator frame with fixed output terminals. In this paper, the BDFM is used as a variable frequency transformer (BVFT). A prototype machine is designed and simulated to verify the system validity.","autors":"A. S. Abdel-Khalik; A. Elserougi; S. Ahmed; A. Massoud","citation-count":4.0,"id":"10.1049/cp.2012.0179","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6242028","publication-year":"2012","title":"Brushless doubly fed induction machine as a variable frequency transformer","topics":[{"affinity":0.9930540323257446,"id":0},{"affinity":0.006945922039449215,"id":1}]},{"abstract":"Fault-tolerant operation capability has become important in AC machine drives as their applications are rapidly expanding towards transportation, renewable energy generation, and transmission. A number of fault-tolerant AC machine drives have been proposed and investigated over the past decades, and this paper comprehensively reviews the relevant technologies. Since the required level of post-fault drive performance is highly dependent on the application, this paper first attempts to provide a clear definition of fault-tolerance in AC machine drives. This new definition is used to evaluate AC machine drive topologies that have been proposed to provide fault-tolerant operation in one or several motor drive components failure. The comprehensive review of AC machine drives includes inverter topologies, control techniques, and electric machine designs.","autors":"W. Lee; G. Choi","citation-count":null,"id":"10.1109/SDEMPED51010.2021.9605560","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9605560","publication-year":"2021","title":"A Comprehensive Review of Fault-Tolerant AC Machine Drive Topologies: Inverter, Control, and Electric Machine","topics":[{"affinity":0.01058307383209467,"id":0},{"affinity":0.9894168972969055,"id":1}]},{"abstract":"This paper presents a state-of-the-art review in modeling approach of hardware in the loop simulation (HILS) realization of electric machine drives using commercial real time machines. HILS implementation using digital signal processors (DSPs) and field programmable gate array (FPGA) for electric machine drives has been investigated but those methods have drawbacks such as complexity in development and verification. Among various HILS implementation approaches, more efficient development and verification for electric machine drives can be achieved through use of commercial real time machines. As well as implementation of the HILS, accurate modeling of a control target system plays an important role. Therefore, modeling trend in electric machine drives for HILS implementation is needed to be reviewed. This paper provides a background of HILS and commercially available real time machines and characteristics of each real time machine are introduced. Also, recent trends and progress of permanent magnet synchronous machines (PMSMs) modeling are presented for providing more accurate HILS implementation approaches in this paper.","autors":"J. S. Lee; G. Choi","citation-count":3.0,"id":"10.30941/CESTEMS.2021.00023","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9551813","publication-year":"2021","title":"Modeling and hardware-in-the-loop system realization of electric machine drives — A review","topics":[{"affinity":0.006620308849960566,"id":0},{"affinity":0.9933797121047974,"id":1}]},{"abstract":"This paper reviews the relative merits of induction, switched reluctance, and permanent-magnet (PM) brushless machines and drives for application in electric, hybrid, and fuel cell vehicles, with particular emphasis on PM brushless machines. The basic operational characteristics and design requirements, viz. a high torque/power density, high efficiency over a wide operating range, and a high maximum speed capability, as well as the latest developments, are described. Permanent-magnet brushless dc and ac machines and drives are compared in terms of their constant torque and constant power capabilities, and various PM machine topologies and their performance are reviewed. Finally, methods for enhancing the PM excitation torque and reluctance torque components and, thereby, improving the torque and power capability, are described","autors":"Z. Q. Zhu; D. Howe","citation-count":1007.0,"id":"10.1109/JPROC.2006.892482","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4168032","publication-year":"2007","title":"Electrical Machines and Drives for Electric, Hybrid, and Fuel Cell Vehicles","topics":[{"affinity":0.010983619838953018,"id":0},{"affinity":0.9890163540840149,"id":1}]},{"abstract":"Flywheels as energy storage systems are good candidates for numerous power system applications such as voltage support, serving fluctuating loads, frequency regulation and renewable energy utilization. Most of these applications utilize flywheel energy storage systems (FESSs) at medium voltage ranges. This paper discusses the optimization of the medium voltage high power converters interfacing the FESS with the grid. A dual three phase induction machine (IM) is proposed to drive the flywheel and is controlled via two series-connected three phase voltage source front end converters (VSCs). The proposed configuration is believed to reduce the converters ratings by a half compared to the conventional configuration where three-phase IM with single three-phase VSC is employed. The machine modelling and control are presented, in addition to converters DC links balancing technique. The performance of the proposed system is verified via simulation using MATLAB/Simulink.","autors":"M. I. Daoud; A. S. Abdel-Khalik; A. Elserougi; A. Massoud; S. Ahmed","citation-count":4.0,"id":"10.1049/cp.2014.0394","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6836993","publication-year":"2014","title":"Medium voltage flywheel energy storage system employing dual three-phase induction machine with machine-side series-connected converters","topics":[{"affinity":0.9920503497123718,"id":0},{"affinity":0.00794967170804739,"id":1}]},{"abstract":"This paper approaches the electromagnetic design and finite-element analysis of two outer rotor machines topologies: radial flux NdFeB permanent magnet synchronous machines and asynchronous machine. The design evaluation of the machines, based on 2-D finite element field analysis, proves that using bonded NdFeB permanent magnets the efficiency of the machine is increased with the penalty of higher costs, due to high price of magnets. Induction machine has the energy conversion efficiency, especially at nominal power, approximately the same. The benefits of the asynchronous machine compared to permanent magnet variants are: lower production costs, higher operating temperature, better robustness, and disadvantages: lower power density, lower power factor.","autors":"M. Dranca; M. Chirca; S. Breban","citation-count":2.0,"id":"10.1109/ICATE.2018.8551433","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8551433","publication-year":"2018","title":"Design evaluation of several electric machines topologies for propulsion of a railway vehicle","topics":[{"affinity":0.9879750609397888,"id":0},{"affinity":0.012024902738630772,"id":1}]},{"abstract":"A current superimposition variable flux reluctance machine has been proposed. This machine requires only a single set of coils that can perform both armature and field coil functions simultaneously. The structure of the current superimposition variable flux machine is similar to a switched reluctance machine. However, the current is feedbacked, and an alternating current is used to rotate. Therefore, there is a possibility that the vibration of the current superimposition variable flux machine is smaller than that of the switched reluctance machine. In this paper, we compare the vibration of the current superimposition variable flux machine and switched reluctance machine.","autors":"A. Kohara; K. Hirata; N. Niguchi","citation-count":null,"id":"10.1109/ICELMACH.2018.8506773","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8506773","publication-year":"2018","title":"Vibration Comparison of Current Superimposition Variable Flux Machine and Switched Reluctance Machine","topics":[{"affinity":0.9830952286720276,"id":0},{"affinity":0.0169048011302948,"id":1}]},{"abstract":"Various performance aspects of multi-phase machines are investigated with the main focus on 6-phase (dual stator) synchronous machines. It is shown that 6-phase machines have benefits over their 3-phase counterparts regardless of machine topology i.e., PM, induction or synchronous. Differences between 6-phase and 3-phase machines are emphasized through detailed design parameter sensitivity. It is revealed that choices such as material for wedges, pitching, etc. have distinct impacts on the two layouts. By studying the effect of phase shift between the two 3-phase systems it is shown how this affects machine losses as well as space harmonic patterns. This can be beneficial when compensating harmonics by controlling the converter. A brief study of 9 and 12-phase synchronous machines shows the potential when going to even higher phase numbers when considering torque density and torque vibrations.","autors":"K. S. Khan; W. M. Arshad; S. Kanerva","citation-count":19.0,"id":"10.1109/ICELMACH.2008.4799836","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4799836","publication-year":"2008","title":"On performance figures of multiphase machines","topics":[{"affinity":0.990021288394928,"id":0},{"affinity":0.00997877772897482,"id":1}]},{"abstract":"In order to meet the increasing demand for electric vehicles, automotive suppliers such as ZF Friedrichshafen AG are trying to develop modular electric motor platforms. In order to find the optimal platform and to be able to use machine learning techniques, a large amount of data is required. This article shows an overall concept that includes a central database. With this it is possible to build a continuously growing data lake to support the electric machine design with a data-driven solution. The efficient sampling algorithm developed makes it possible to incorporate empirical knowledge into the sampling. In addition, it is possible to reuse calculated designs and no design is calculated more than once. This achieves the efficient generation of large amounts of data, which enable the use of machine learning.","autors":"M. Heroth; H. C. Schmid; W. Hofmann","citation-count":null,"id":"10.1109/ICEM51905.2022.9910814","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9910814","publication-year":"2022","title":"Efficient Sampling Algorithm for Electric Machine Design Calculations incorporating Empirical Knowledge","topics":[{"affinity":0.00937135610729456,"id":0},{"affinity":0.9906286001205444,"id":1}]},{"abstract":"Nowadays there is a serious trend to design electrical machines for propulsion units as cheep as possible. Machines that lack the permanent magnets having performances close to those that embed permanents magnets represent now the main interest in this field. Such a machine is the variable reluctance synchronous machine. Being derived from the family of synchronous machines is field oriented controlled. In the present paper one particular such machine is presented in detail designed for automotive applications. An analytical model is also presented used later to implement the maximum torque per ampere control, considering this strategy as being the one suitable for such applications. The simulation program is built in Matlab Simulink presented together with the control strategy and the results. The model of the machine takes into account both saturation and iron losses.","autors":"M. Ruba; F. Jurca; C. Martis; R. Martis; P. F. Piglesan","citation-count":5.0,"id":"10.1109/ICEPE.2014.6969921","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6969921","publication-year":"2014","title":"Analysis of maximum torque per ampere control strategy for variable reluctance synchronous machines for traction applications","topics":[{"affinity":0.01428730133920908,"id":0},{"affinity":0.9857127070426941,"id":1}]},{"abstract":"A novel control strategy, applicable to Permanent Magnet Synchronous Machines (PMSMs) and Brushless DC Machines (BLDCMs), was investigated and modelled by an academic team in collaboration with NEC Electronics Europe GmbH. The company has recently developed a new microcontroller, based on a simple sensorless control principle of PMSMs, which is equally applicable to Brushless DC Machines. The use of the new microcontroller in drive systems was modelled by the research team at the university using a Visual C++ environment and was compared with traditional control methods. Extensive simulations were carried out and the results validated the new control principle, which is simple to implement and cost effective if using the novel NEC Electronics Europe GmbH microcontroller. The performance obtained proves the novel control strategy to be at least as effective as the classical ones, at reduced cost. Typical applications are in the white goods industry.","autors":"M. Cirstea; A. Dinu","citation-count":null,"id":"10.1109/ISIE.2006.295893","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4078568","publication-year":"2006","title":"Simulation Package for a New Sensorless Control Strategy for PM Synchronous Machines and Brushless DC Machines","topics":[{"affinity":0.00811078492552042,"id":0},{"affinity":0.991889238357544,"id":1}]},{"abstract":"This paper presents a finite element-based circuit model approach for permanent magnet synchronous machines, electrically excited synchronous machines, and wound rotor induction machines, taking skewing of the rotor or the stator into account. These models utilize lookup tables created by 2-D finite element simulations in advance. Inspired by the finite element multislice technique, a multiple evaluation of these lookup tables is performed to consider skewing. The resulting models are comparable with quasi-static finite element multislice models with voltage fed coils. The only difference is caused by interpolation errors. However, the simulation cost is significantly lower and the memory demand for the lookup tables is acceptable.","autors":"M. Mohr; O. Bíró; A. Stermecki; F. Diwoky","citation-count":11.0,"id":"10.1109/TMAG.2013.2280292","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6749201","publication-year":"2014","title":"A Finite Element-Based Circuit Model Approach for Skewed Electrical Machines","topics":[{"affinity":0.9896456003189087,"id":0},{"affinity":0.010354417376220226,"id":1}]},{"abstract":"In this paper a scaling methodology for the solution of 2D FE models of electric machines is proposed. This allows a geometrical and rotor resistance scaling of a squirrel cage induction machine enabling an efficient numerical optimization. The 2D FEM solutions of a reference machine are calculated by a model based hybrid numeric induction machine simulation approach. In contrast to already known scaling procedures for synchronous machines the FEM solutions of the induction machine are scaled in the stator-current-rotor-frequency-map and then transformed into the torque-speed-map. This gives the possibility to use a new time-scaling factor, that is necessary to keep a constant field distribution. The scaling procedure is validated by the finite-element-method and used in a numerical optimization process for the sizing of an electric vehicle traction drive considering the gear ratio. The results show that the scaling procedure is very accurate, computational very efficient and suitable for the use in machine design optimization.","autors":"M. Nell; J. Lenz; K. Hameyer","citation-count":7.0,"id":"10.1109/ICELMACH.2018.8507088","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8507088","publication-year":"2018","title":"Efficient Numerical Optimization of Induction Machines by Scaled FE Simulations","topics":[{"affinity":0.009684087708592415,"id":0},{"affinity":0.9903159141540527,"id":1}]},{"abstract":"In this paper, research into torque ripple production has been undertaken for both the healthy and open-circuit fault- tolerant conditions of a five-phase permanent magnet (PM) machine by using the instantaneous power (I-Power) approach. When only the fundamental component of the phase currents is applied to the phase windings, it has been shown that the 9th and 11th harmonics of the back-electromotive force (back-EMF) causes torque ripples in a five-phase PM machine and its frequency is ten times the frequency of the fundamental phase currents. When the combined fundamental and third harmonic components of the phase currents are applied to the phase windings, it has been shown that the 7th and 13th harmonic of the back-electromotive force (back-EMF) causes additional torque ripples in a five-phase PM machine .These torque ripples under fault-tolerant conditions have been analyzed analytically, as well. It has been proven that there are interactions between the fundamental component of current and the third harmonic component of the back-EMF and vice versa. These interactions cause torque ripples. A finite element analysis (FEA) model of the five-phase PM machine has been done to validate the analytical results.","autors":"A. Akay; P. Lefley","citation-count":1.0,"id":"10.30941/CESTEMS.2020.00042","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9312764","publication-year":"2020","title":"Research on torque ripple under healthy and open-circuit fault-tolerant conditions in a PM multiphase machine","topics":[{"affinity":0.9926270842552185,"id":0},{"affinity":0.007372964173555374,"id":1}]},{"abstract":"Currently, it is a challenging issue to predict the thermal-induced time-varying error for the movement axis of the computer numerical control (CNC) machine tool. Subsequently, it is a challenge to predict the machining accuracy for a certain workpiece when the machine tool and numerical control program are determined. In order to resolve this shortcoming, the time-varying error prediction and compensation for the movement axis of the CNC machine tool was studied in this article, and the advantage of digital twin in predicting the changing trend for the physical entity was applied. The framework of time-varying error prediction and compensation for the CNC machine tool's movement axis was proposed based on the digital twin concept, which includes the physical entity layer, data transmission layer, function execution layer, and application service layer. The digital twin of the movement axis, containing a time-varying error model based on heat transfer theory and visual model, was created and packaged as a ready-to-use software for predicting and compensating time-varying error. The prediction experiment of the hole-pitch time-varying error for a workpiece was carried out. It was found that the difference between prediction error and actual error is only −0.2–2.6 μm. The fluctuation range of hole-pitch error is reduced by 69.19% with the time-varying error compensation in real-time. The experimental results show that the method of time-varying error prediction and compensation based on a digital twin is an effective and feasible scheme.","autors":"K. Liu; L. Song; W. Han; Y. Cui; Y. Wang","citation-count":3.0,"id":"10.1109/TII.2021.3073649","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9405443","publication-year":"2022","title":"Time-Varying Error Prediction and Compensation for Movement Axis of CNC Machine Tool Based on Digital Twin","topics":[{"affinity":0.004556578584015369,"id":0},{"affinity":0.9954434037208557,"id":1}]},{"abstract":"This paper develops an improved dual-stator Vernier machine using ferrite magnet materials, aiming to replace an industrial interior permanent magnet machine with rare earth magnets in a low speed industrial application. The improved Vernier machine design adapts the single winding dual-stator topology with an empty inner stator core mainly to improve the torque density and eliminate the heat from the inner stator windings of conventional dual-stator Vernier machines. A drum rotor is also proposed to provide mechanical and structural enhancements. This paper compares the performance of the improved Vernier machine design against an industrial interior permanent magnet machine with rare earth magnets. The comparison shows that the improved design using ferrite magnets has even higher torque density and efficiency than those exhibited in the industrial interior permanent magnet machine with rare earth magnets. The improved Vernier machine design has considerable potential to replace industrial rare earth interior permanent magnet machines in low speed applications.","autors":"Z. S. Du; T. A. Lipo","citation-count":15.0,"id":"10.1109/TEC.2019.2931496","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8778674","publication-year":"2019","title":"Design of an Improved Dual-Stator Ferrite Magnet Vernier Machine to Replace an Industrial Rare-Earth IPM Machine","topics":[{"affinity":0.9914981722831726,"id":0},{"affinity":0.00850181095302105,"id":1}]},{"abstract":"Compromising wavelet kernel and multi-class least squares support vector machines, this article put forward to a fault diagnosis model based on multi-class wavelet support vector machine. The model heightens auto-adaptive model classification ability by adjustment of scale parameter of wavelet kernel, and make use of remarkable learning ability and generalization ability of small sample of vector machines to improve speed and effectiveness of fault diagnosis. And taking fault diagnosis in heat-recycling system of thermal power plant as an example to analysis.","autors":"Peng Lu; Da-Ping Xu; Yi-Bing Liu","citation-count":1.0,"id":"10.1109/ICMLC.2005.1527697","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1527697","publication-year":"2005","title":"Study of fault diagnosis model based on multi-class wavelet support vector machines","topics":[{"affinity":0.989113450050354,"id":0},{"affinity":0.010886600241065025,"id":1}]},{"abstract":"Fractional-slot concentrated windings have been gaining a lot of interest in permanent magnet synchronous machines. This is due to the several advantages provided by this type of windings which include: shorter non-overlapping end turns, higher efficiency, higher power density, higher slot fill factor, lower manufacturing cost, better flux-weakening capability resulting in wider constant power speed range, and fault-tolerance. However, the tradeoffs involved in using this type of windings in induction machines have not been addressed in literature. This paper examines induction machine performance with fractional-slot concentrated windings using the standard distributed lap windings as reference. Four designs are compared and various performance tradeoffs highlighted. The first machine has integral-slot distributed 2 slots/pole/phase lap winding and it serves as the reference winding. The second machine has a double-layer 1/2 slot/pole/phase winding, a workhorse for brushless DC machines. The third machine has double-layer 2/5 slot/pole/phase winding. Lastly, the fourth machine has single-layer 2/5 slot/pole/phase windings. The comparison includes torque-speed curves (including the effects of major space harmonic components), rotor bar losses, and ripple torque levels.","autors":"A. M. El-Refaie; M. R. Shah","citation-count":34.0,"id":"10.1109/08IAS.2008.30","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=4658818","publication-year":"2008","title":"Comparison of Induction Machine Performance with Distributed and Fractional-Slot Concentrated Windings","topics":[{"affinity":0.055065054446458817,"id":0},{"affinity":0.9449349641799927,"id":1}]},{"abstract":"In this paper, the influence of temperature variation on the characteristics and performance of flux-switching permanent magnet (FSPM) machines are analyzed and investigated. The flux linkage, torque output capability, and inductance variation as functions of the temperature are simulated and analyzed. The paper also shows the influence of temperature variation on key FSPM machines performance including constant torque curves, voltage limit ellipses, maximum torque per ampere curves, and torque-speed curves. The difference of temperature effects between FSPM machines and interior permanent magnet machines are also discussed. The results and trends shown in this paper set a foundation for developing control algorithm which takes the temperature effects into consideration, especially in the applications where operating temperature varies significantly.","autors":"S. Li; D. Han; B. Sarlioglu","citation-count":5.0,"id":"10.1109/IEMDC.2017.8002084","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8002084","publication-year":"2017","title":"Analysis of the influence of temperature variation on performance of flux-switching permanent magnet machines for traction applications","topics":[{"affinity":0.010065275244414806,"id":0},{"affinity":0.9899347424507141,"id":1}]},{"abstract":"In this paper, we propose a nonconvex online Support Vector Machine (SVM) algorithm (LASVM-NC) based on the Ramp Loss, which has the strong ability of suppressing the influence of outliers. Then, again in the online learning setting, we propose an outlier filtering mechanism (LASVM-I) based on approximating nonconvex behavior in convex optimization. These two algorithms are built upon another novel SVM algorithm (LASVM-G) that is capable of generating accurate intermediate models in its iterative steps by leveraging the duality gap. We present experimental results that demonstrate the merit of our frameworks in achieving significant robustness to outliers in noisy data classification where mislabeled training instances are in abundance. Experimental evaluation shows that the proposed approaches yield a more scalable online SVM algorithm with sparser models and less computational running time, both in the training and recognition phases, without sacrificing generalization performance. We also point out the relation between nonconvex optimization and min-margin active learning.","autors":"S. Ertekin; L. Bottou; C. L. Giles","citation-count":95.0,"id":"10.1109/TPAMI.2010.109","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5473234","publication-year":"2011","title":"Nonconvex Online Support Vector Machines","topics":[{"affinity":0.9932416677474976,"id":0},{"affinity":0.006758297793567181,"id":1}]},{"abstract":"It is shown that the electromagnetic theory of the superconducting AC machine is very close to that of the surface-magnet permanent-magnet synchronous machine. Methods for calculating the EMF and synchronous inductances are practically identical and almost interchangeable. It is not only possible to use related algorithms for design calculations, but the results are readily compared in a form convenient for studies, especially of very large machines. The theory includes not only the steady state but also the subtransient state following a short-circuit fault. Methods for analyzing the demagnetization of permanent magnets, or the quenching of the superconducting winding, are closely related. The paper describes all the main points of the theory with numerical and graphical illustrations.","autors":"T. J. E. Miller; M. I. McGilp","citation-count":3.0,"id":"10.1109/ICEMS.2009.5382829","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5382829","publication-year":"2009","title":"Unified theory of superconducting and PM synchronous machines","topics":[{"affinity":0.4575958847999573,"id":0},{"affinity":0.5424041152000427,"id":1}]},{"abstract":"In AC-machines with concentrated, non-overlapping stator windings the calculation of the winding factor xi - especially the pitch factor xip is difficult as the coil embraces only one tooth. This paper attempts to verify several xip-choices using an uncommon approach with finite element (FE) analysis. The results match good with classical analytical xip calculation methods","autors":"G. Maier; H. Kofler; J. Bacher","citation-count":3.0,"id":"10.1109/EPE.2005.219314","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=1665504","publication-year":"2005","title":"The use of pitch factor in calculations of AC-machines with concentrated windings","topics":[{"affinity":0.08041959255933762,"id":0},{"affinity":0.9195804595947266,"id":1}]},{"abstract":"Experimental validation of motor drives to ensure appropriate efficiency and performance is essential to such sectors as: industrial; aerospace, naval and land propulsion devices, and utilities. For low power machines, this is typically a non-issue since test beds are relatively inexpensive and accessible. However, as power levels increase into the upper kilowatt and megawatt range, validation of prototype machines and drives becomes costly. These costs are primarily: materials, transportation, and test site development and operation. The virtual machine (VM) concept provides a solution for de-risking these costs by utilizing the power-hardware-in-the-loop (PHIL) concept in conjunction with high-fidelity machine models and detailed load dynamics. The VM and load dynamics are simulated with a real-time digital simulator which generates appropriate control commands to a power electronics based voltage amplifier that interfaces via a cascaded LC-LC type filter to a variable speed drive (VSD). The controlled voltage amplifier, in conjunction with the LC-LC type filter, acts as a current sink to the VSD. Provided the voltage amplifier has sufficient bandwidth, the VM will closely represent the terminal characteristics of a real machine and load, with respect to the VSD. This paper addresses the establishment of a 25 kW virtual machine test bed and associated issues.","autors":"F. Fleming; C. S. Edrington; M. Steurer; O. Vodyakho","citation-count":4.0,"id":"10.1109/IEMDC.2009.5075350","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=5075350","publication-year":"2009","title":"Development and implementation of a 25 kW virtual induction machine test bed utilizing the power-hardware-in-the-loop concept","topics":[{"affinity":0.005113657563924789,"id":0},{"affinity":0.9948863387107849,"id":1}]},{"abstract":"This work focuses in detail on the flux density distribution in three-phase distributed winding machines, showing how its asymmetries in the teeth and back iron can be evaluated, and eventually compensated for. In order to achieve uniform flux density distributions, an asymmetrical stator geometry is proposed. A new set of geometrical parameters has been defined to balance the flux densities in the stator, while maintaining the same slot geometry (i.e., current density and amount of copper) and iron volume. The comparison, between a classical geometry and the proposed asymmetrical one, is carried out with the results showing the differences on the stator flux densities and the resulting torque performance. The new concept of asymmetrical design is validated for a surface mounted permanent magnet (SPM) machine as a case study. The outcomes of this work highlight the potential benefits of the presented solution with respect to the core saturation.","autors":"D. De Gaetano; G. Sala; M. Degano; D. Gerada; C. Gerada","citation-count":null,"id":"10.1049/icp.2021.1167","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9545317","publication-year":"2020","title":"ASYMMETRICAL STATOR GEOMETRY DESIGN FOR THREE-PHASE MACHINES WITH DISTRIBUTED WINDING","topics":[{"affinity":0.011857645586133003,"id":0},{"affinity":0.9881423115730286,"id":1}]},{"abstract":"The efficiency improvement is one of the main research topics in the field of electrical machines nowadays. The three-phase induction machines represent the majority of the machines used in the industry. Due to that, there is a motivation for researches to investigate how to improve induction machines efficiency or how to replace them with other types of machines having higher efficiency level. The benefits of the induction machine are line-start capability, robustness, and price. Line-start capability means that there is no need for extra power electronics. Avoiding of the power electronics in the case when only one certain load point is needed can lead to a price decrease, smaller environmental footprint, and more compact solution. An alternative machine type that can provide potentially higher efficiency compared to the induction machine, especially for small powers is a line-start permanent magnet machine.The topic of this paper is dedicated to the design and analysis of a 1.5 kW four-pole line-start permanent magnet machine for general usage. The designed line-start permanent machine is using the same stator lamination as the standard commercial 1.5 kW totally enclosed fan-cooled induction machine. The results of the design, together with electromagnetic analysis of the line-start permanent magnet machine performance, are illustrated. It is demonstrated that a simple replacement of the induction machine rotor by the line start permanent magnet rotor using the presented approach can facilitate in achieving of the higher efficiency level of the machine.","autors":"J. Barta; L. Knebl; M. Toman; V. Abramenko; I. Petrov; I. Lolova","citation-count":null,"id":"10.1109/ME49197.2020.9286655","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9286655","publication-year":"2020","title":"Design and Analysis of 1.5kW, 1500 rpm Line-Start Permanent Magnet Synchronous Machine","topics":[{"affinity":0.9944826364517212,"id":0},{"affinity":0.005517285317182541,"id":1}]},{"abstract":"Thermal errors have the largest contribution, as much as about 70%, to the machining inaccuracy of computer-numerical-controlled (CNC) machining centers. The error compensation method so far plays the most popular and effective way to minimize the thermal error. How to accurately and quickly build an applicable thermal error model (TEM) is the kernel work of thermal error compensation. On the basis of some comprehensive machine-learning schemes, past proposed TEMs had impressive merits for dealing with the thermal error modeling of single-function (milling or turning cutting) machine tools with only considering one set of thermal key points. These proposed modelling methodologies become worse when applied to CNC compound milling-turning machining centers in actual cutting applications. This paper proposes a two-mode integral TEM based on the Lasso and the random forest regression schemes to quickly and accurately predict the thermal deformations of such a machine. The first mode is the thermal error modeling for milling cutting conditions, and the second mode is that for turning cutting conditions. For data reduction, two different sets of temperature key points, one for milling and the other for turning, are obtained. Then, on the basis of the random forest regression scheme, we separately establish two TEMs but concurrently use them to predict the tool-center-point deformations of both milling as well as turning spindles. Further, we compare our proposed TEM with several frequently-used machine-learning-based TEMs and the results show that our proposed TEM are the best among all, no matter in the modelling experiment or in the test experiment. The proposed TEM has a maximum prediction error of 6.08  $\\mu \\text {m}$ for milling cutting and that of 1.455  $\\mu \\text {m}$  for turning cutting in the modeling experiment. By our proposed two-mode integral TEM, the thermal error of a multi-function milling-turning machining center can be accurately predicted and quickly compensated.","autors":"W. Lian; L. Zhang; K. -C. Wang; H. -Y. Chen; C. -H. Yang","citation-count":null,"id":"10.1109/ACCESS.2022.3197797","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=9853541","publication-year":"2022","title":"A Novel Two-Mode Integral Approach for Thermal Error Modeling in CNC Milling-Turning Machining Center","topics":[{"affinity":0.0038611518684774637,"id":0},{"affinity":0.9961388111114502,"id":1}]},{"abstract":"A current superimposition variable flux reluctance machine that can control its torque constant has been proposed. This machine requires only a single set of windings that can perform both armature and field winding functions simultaneously. Therefore, it is easy to apply a distributed winding and sprit core to our proposed machine. In this paper, a current superimposition variable flux machine using distributed windings is proposed and compared with that using concentrated winding. First, the structure and operational principle of the proposed machine are described. Next, the static characteristics are computed using 2D finite element analysis. Finally, the N-T characteristics are computed under vector control and the effectiveness of the proposed machine is discussed.","autors":"A. Kohara; K. Hirata; N. Niguchi; Y. Ohno","citation-count":2.0,"id":"10.1109/ICELMACH.2016.7732872","pdf-link":"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7732872","publication-year":"2016","title":"Study on a current superimposition variable flux reluctance machine with distributed winding","topics":[{"affinity":0.9866304993629456,"id":0},{"affinity":0.013369533233344555,"id":1}]}],"lda_plot":"CjxsaW5rIHJlbD0ic3R5bGVzaGVldCIgdHlwZT0idGV4dC9jc3MiIGhyZWY9Imh0dHBzOi8vY2RuLmpzZGVsaXZyLm5ldC9naC9ibWFiZXkvcHlMREF2aXNAMy4zLjEvcHlMREF2aXMvanMvbGRhdmlzLnYxLjAuMC5jc3MiPgoKCjxkaXYgaWQ9ImxkYXZpc19lbDk0MTQwMzMyNDY1NzczMDI0OTIxODI2ODgxMSI+PC9kaXY+CjxzY3JpcHQgdHlwZT0idGV4dC9qYXZhc2NyaXB0Ij4KCnZhciBsZGF2aXNfZWw5NDE0MDMzMjQ2NTc3MzAyNDkyMTgyNjg4MTFfZGF0YSA9IHsibWRzRGF0IjogeyJ4IjogWzAuMDI5NjYzOTYzOTI0MTc2NzE2LCAtMC4wMjk2NjM5NjM5MjQxNzY3MTZdLCAieSI6IFswLjAsIDAuMF0sICJ0b3BpY3MiOiBbMSwgMl0sICJjbHVzdGVyIjogWzEsIDFdLCAiRnJlcSI6IFs1My40NDkxOTM2OTY2ODI4MjYsIDQ2LjU1MDgwNjMwMzMxNzE3XX0sICJ0aW5mbyI6IHsiVGVybSI6IFsicGhhc2UiLCAiYW5hbHlzaXMiLCAicHJvcG9zZSIsICJpbXByb3ZlIiwgImluc3VsYXRpb24iLCAicm90b3IiLCAiY2xhc3NpZmljYXRpb24iLCAidHVybiIsICJ2ZWN0b3IiLCAibGluZSIsICJ2YXJ5IiwgInN0YXJ0IiwgIndvcmsiLCAiYXhpcyIsICJzdGF0b3IiLCAibW90aW9uIiwgImRyaWxsIiwgImN1cnJlbnQiLCAiaGlscyIsICJsYXllciIsICJpbmR1Y3Rpb24iLCAic3ZtIiwgImV4aXN0IiwgImNyb3NzIiwgInRlc3QiLCAibGluZWFyIiwgImVsZWN0cmljIiwgImNvcmUiLCAiY29udHJvbGxlciIsICJkcml2ZSIsICJoaWxzIiwgImluc3VsYXRpb24iLCAiZHJpbGwiLCAidmFyeSIsICJiYXJyaWVycyIsICJzZWEiLCAiZWZmaWNpZW50IiwgInJvdiIsICJpc3N1ZSIsICJ2YXJpYXRpb24iLCAic2VydmljZSIsICJ0cmVuZCIsICJtYXhpbXVtIiwgImFyIiwgIm1hbGljaW91cyIsICJhdXRvbW90aXZlIiwgIm92ZXJhbGwiLCAicHJvcGVydGllcyIsICJjYWxjdWxhdGUiLCAibWljcm9jb250cm9sbGVyIiwgImFjY2VzcyIsICJkaWdpdGFsIiwgInBtc21zIiwgImt2IiwgImFydCIsICJlc3RhYmxpc2giLCAiZ3VpZGUiLCAic3VydmV5IiwgImZlIiwgIm1lYXN1cmUiLCAidHVybiIsICJsYXllciIsICJ3b3JrIiwgImxpbmVhciIsICJ0ZW1wZXJhdHVyZSIsICJjb3JlIiwgInN5bnJlbCIsICJpcG1zbSIsICJ0ZXN0IiwgImVsZWN0cmljIiwgImRyaXZlIiwgInNjYWxlIiwgImFwcGxpY2F0aW9uIiwgInBtIiwgInByZWRpY3QiLCAiZ3JpbmQiLCAibWFjaGluZSIsICJlcnJvciIsICJkYXRhIiwgImxldmVsIiwgIm1hZ25ldCIsICJzeW5jaHJvbm91cyIsICJkZXNpZ24iLCAicGVybWFuZW50IiwgInBhcGVyIiwgImhpZ2giLCAiY29udHJvbCIsICJwcmVzZW50IiwgInJlc3VsdCIsICJkaWZmZXJlbnQiLCAidG9ycXVlIiwgInRpbWUiLCAicGVyZm9ybWFuY2UiLCAidGhlcm1hbCIsICJtb2RlbCIsICJ3aW5kIiwgImNvbXBhcmUiLCAicG93ZXIiLCAic3BlZWQiLCAicHJvcG9zZSIsICJlbGVjdHJpY2FsIiwgImZsdXgiLCAiYXBwbGljYXRpb25zIiwgImRpYWdub3NpcyIsICJsaW5lIiwgInZmdCIsICJ3YXZlbGV0IiwgInN0YXJ0IiwgImV4aXN0IiwgImNyb3NzIiwgImFsdGVybmF0aXZlIiwgIndlYiIsICJjb21wdXRlIiwgImZyYW1lIiwgImF4IiwgIm91dGVyIiwgImVxdWl2YWxlbnQiLCAiY29udG91ciIsICJjdXJyZW50cyIsICJtb3Rpb24iLCAidHJhbnNpZW50IiwgImVsZWN0cm8iLCAicHJpY2UiLCAiYXN5bmNocm9ub3VzIiwgInN1cGVyaW1wb3NpdGlvbiIsICJwYXJhbWV0ZXIiLCAiYXJjaGl0ZWN0dXJlIiwgImVhc3kiLCAiYXV4aWxpYXJ5IiwgInZhbHVlIiwgImhlc2ZwbW1zIiwgImRldGVybWluYXRpb24iLCAibW90aXZlIiwgImNvbnZlcnRlcnMiLCAiY2xhc3NpZmljYXRpb24iLCAiYWxnb3JpdGhtcyIsICJwaGFzZSIsICJpbXByb3ZlIiwgImFuYWx5c2lzIiwgInZlY3RvciIsICJpbmR1Y3RhbmNlIiwgImNvbnRyb2xsZXIiLCAicHJvcG9zZSIsICJyb3RvciIsICJtYWNoaW5lIiwgImF4aXMiLCAic3ZtIiwgInN0YXRvciIsICJjdXJyZW50IiwgImluZHVjdGlvbiIsICJ3aW5kIiwgImFjY3VyYWN5IiwgIm1haW4iLCAiZWxlY3RyaWNhbCIsICJwb3dlciIsICJtb2RlbCIsICJwcm9jZXNzIiwgInBhcGVyIiwgImZpbml0ZSIsICJtZXRob2QiLCAiZmx1eCIsICJjb250cm9sIiwgImFwcGxpY2F0aW9ucyIsICJwZXJtYW5lbnQiLCAiYmFzZSIsICJtYWduZXQiLCAiZWxlbWVudCIsICJyZXN1bHQiLCAic3luY2hyb25vdXMiLCAidG9ycXVlIiwgInByZXNlbnQiLCAiZGVzaWduIiwgInBlcmZvcm1hbmNlIiwgImNvbXBhcmUiLCAiaGlnaCJdLCAiRnJlcSI6IFs1MC4wLCAzMC4wLCA1OC4wLCAxOC4wLCAxMi4wLCAzOC4wLCAxMy4wLCAyMC4wLCAxNi4wLCA3LjAsIDEwLjAsIDYuMCwgMTUuMCwgMTkuMCwgMzAuMCwgNy4wLCA3LjAsIDI3LjAsIDYuMCwgMTIuMCwgMzMuMCwgMTMuMCwgNS4wLCA1LjAsIDI2LjAsIDE0LjAsIDI5LjAsIDE2LjAsIDguMCwgMjcuMCwgNi4xMTUwNzYxNjcyNDU2NjcsIDExLjMyMDM5MTU4MDYxODAxNywgNi43ODYyMDM5OTE4NjIxNTU1LCA5LjY5MTc4Mzk2NjUyMTM3MiwgMy43MDE1NDE2NTQ3NjY3NzgsIDMuNjAzNDUxNTYwMTYyMDg3NiwgNi40NDcyMzM3NzY3OTk4NTYsIDMuNTc0NzAyNzYyMjk5MTQ3NiwgNy44NjM2NjY2MDQ3MjMxMjMsIDIuODU1MTgwMzUzODgxMDcsIDMuNTY4MDAwOTI2ODI1OTEwNywgNC45NzgwODczMjcxNjgxMDcsIDYuMzkwMjIzOTY2NjA4NzE2LCAzLjU0MzQxMDQ3NTgxMDMwMjQsIDMuNTM4NzE0NDIyNDAzNTQ0MywgNC4yMzY0NDAyMTg2NDUyNjgsIDQuOTQwNzA4NjQ5NDgwNTA5LCAzLjUyNjQ3NjA3MjA5MzAxOTMsIDcuMDQ2NzA1MzEwMjkxMDMyLCAyLjgxNDcyNDcwMzE4NDM1ODMsIDIuODA2MzMwNTIwMTM3OTQ0LCA0LjkwMjk0NTUwNTM5MzgzOTYsIDIuODAxMzgwMzkxMDY4MjMyNCwgMi44MDA1MTYzMzUxMjM1NDcsIDIuNzkzNzgxOTY0MDU3MTA3NSwgMy40ODAyNTI5Mjg2ODM2MDc1LCAyLjc4MTcwMTU3MjgwOTc2NjcsIDIuNzc5ODYxOTQ1Nzk1NjAwNCwgNC4xNjc0NzU2ODkwNDAwNzYsIDQuMTY1ODUzMzc5OTE5NDQzLCAxNi42MDIzNzM3NjY0Njg5NjUsIDEwLjQxMjE0MDg3NTY1MDYxNiwgMTIuMzUxMzEzODkwMTI2NjY3LCAxMS41MTQ1NjQwMDA4NTQ0NjMsIDcuNDc4OTg3MTA5OTMzMzc1LCAxMy4yMzI3MzkzNzEwNDMwMjQsIDQuODE0Njg0MTQwMjk2MTg1LCA1LjQ1NDYxNDA1NjQ4MDQ0OSwgMjAuMDA5MDI4MjAyOTY3MzQ3LCAyMi4xNjg2NTA0NzU1NDkyNjMsIDIwLjQzOTg0NTE1NTgyNTYyNiwgOC41OTgxMDQyMjMxNzM0MzMsIDguNTczODUzMDM2NDM1MDQzLCAxNy45ODQxODk3MTY2NzczLCA3LjkzOTY5NDU4Njc3NjM4OTUsIDYuMDg0MjMwNDM3OTgyNjE4LCAyMTQuMzc1NTA3NjA1OTgyOTMsIDE1LjAxMzcxMjkwNjY1MzIwNiwgMTcuNTAyNDQ2MzY0NDY2OTQ4LCAxMi4yMzAzMzUxMjk4ODUyMDksIDM0Ljg1MDIxNjAzNTIxMzAxNiwgMzAuNTI4OTY4Njg4MzQyMzc4LCAyNy4zMzI4MDExNjA5ODM3MiwgMzUuODI5MjY4MTY0ODAzMzk1LCA0My4zOTE5NzQ1NzE2Nzc5NCwgMjIuNzMyMzMxODYzMDYzNzM4LCAzNC43Nzk3NTIzODQ2ODc0MDYsIDI1LjkyMDczNjU0NjkwMjExLCAyNy4zNjg5OTA2NzUxNTc5MDcsIDE1LjkzNjMyNDk3MTQ3ODQ2NSwgMjMuODYwMDU2MjU1MDY3NTI2LCAxNy44MzAwOTEyMTI3MzQ4NjcsIDIyLjE2MTE0MTk1NjA1NTIzNiwgMTQuOTIyMTY1MTk4Mjc4NzI2LCAyOS43NTAwODk0MzY0ODMwMSwgMjUuNzk5Mjc4OTQyMjA0OTU3LCAxOS4wMjYyMjQ3OTM5ODk2MywgMjMuODA2ODQ0OTEzMjkyMDMsIDE2LjE4OTY4MjM2Nzc0NzgzLCAyMS45NTQ4MDE3MjA2ODc0MiwgMTcuMTkyOTQ3OTMyODUzOTU4LCAxNi4xMDczMDQyMzI2NjM4OSwgMTUuMzM2MDg4NDc5MDAyMDU0LCAzLjU2NjE2MDM3Njc5NzQ5MTQsIDYuMzYxNzkzMjg1NjAzNDIsIDMuNTA0NTEzMTE3NzQwNDU4NSwgMi43OTc4NjQ5OTU2OTE3ODgzLCA1LjU3OTE2OTg0OTE0MDM2NiwgNC44MjYzMDgyOTIxODM2MTMsIDQuODIyMjkxMDExNjY3NjUyNSwgMy40MDE5OTc4MzgxNjg1Mzc0LCA0LjA3ODY0Mjg5Njc5MDIwMywgMy4zOTY0ODU0MzM2NTI2NjczLCA0LjA1MDY4NzE5MjgzMzU2MiwgMy4zNTc5MjAwMTY1NzgwMzM2LCA0LjAyNjk3Njc1ODQ5ODE5MiwgNC42ODEwODM5OTA4ODY4NDY1LCA0LjY4MDk4Mjc1ODUzMjY4NiwgNC42NjYyMDY3MjgzNzczMywgNS45NjczOTExNjg1NjAxNTksIDMuMzEyOTYwMDg5MTMyMjU5MywgMi42Mzk5NzE1MDg1MzM1MiwgMi42MzYzODI3MzUwNTUxNDksIDIuNjMwNTc1NTAyMTIzMjA4NywgNC41OTk3NjgwMjA4NjUxNDcsIDQuNTkyMDc1NjU5Nzk5NjQsIDMuMjc3MDM4ODI2NTM4OTQ2NywgMy4yNzUzNTc2NzcyNzI4NDUsIDMuOTI3MTIxNDIzOTI0MzczNSwgMy4yNzAwNjIyMzAxMzEzODMsIDIuNjExNDgwNDQxMTY1NDUyNCwgMi42MTA2MDQ4MjQ1NjM2NTM3LCAyLjYwODg0ODE4MzY0ODgyOSwgNC41Mjk2OTc0OTQ0OTMyMywgMTAuNzUxMzc2MTE2OTgzNjAyLCA1LjEyNTY5Mzg5NDY1ODU1MSwgMzcuMDk0ODY3NDQ1MDA1MDcsIDEzLjk0MDEzMDM4MDUwNTksIDIxLjgyNDI1NTgwNzk3NTUyNiwgMTEuOTkxNDUwODI0NjA1MzE0LCA2LjI2NTA3NTcyMTM5MTY4LCA2LjgwNTg2MzI4MzQ4NjI2NywgMzYuOTc0OTkxMDMzMDAzMDcsIDI0LjY1MDgyOTI2MTAyNjY4NiwgMTg0LjkwMzA5MjU2ODA2OTE4LCAxMy4yMDc1NDM4NDcwOTY1MzMsIDkuMjk0ODM4MDgzNDUxMzgsIDE4Ljg0ODQzMTI1NTUzOTg3NSwgMTcuMDU2OTQ1NjQ1MjczMjk1LCAyMC4zODIyODEzODk3MDE2NzgsIDI5LjI5MDkyMjM2ODE5OTU3OCwgOS41MzE5MjMzOTE2NjE1NjgsIDguMDk3NTk4NTA1MzgwMzE1LCAyMS40MDkyNTE2MDkwMDk5LCAyNi4zNjQ0NTc2NzMzNzIwNTUsIDI5LjU0NTQ1MzM4NTQ0MzQzNCwgMTIuMjc3Mzc2ODUwMTQ1ODgsIDM1Ljg0Mzk0NzAzMTc0NzQ0LCAxMi45NjgxMzYyNTEzNzcyMjQsIDE3LjkzMjEzNDgyMTU3NjgxLCAxOC40MjMwODIzMjEzMDYzNTcsIDI4Ljc3MjU4MzI5Njk0ODU0LCAxNy41NDk3MDMyMTQxMDQ1ODYsIDI2LjE2NDEzNzAxNDM5ODA2NSwgMTUuMDUyNjc2NTQ4NDMxNjI3LCAyMy4wNzY0NTY3NjcyNTE1OTYsIDEyLjA4OTMyNzgwMjEwNDAyLCAxOS43NTI0MTM2ODIxMTQ4LCAxOS45NTczMTQ4ODg4MDYxMDMsIDE3LjQ2NzQ4MTc3NjkxNTExNSwgMTcuOTE1NjUzODQ4MjI1OTU0LCAxNy4zNzQxMDkyMDY1NTk2NTUsIDE1Ljg3MDE1NDYzMDUyNTY3MiwgMTQuODM2OTcyMDMyNTYwNDIxLCAxMy43MTY5NDU5MTg0NjYxNjZdLCAiVG90YWwiOiBbNTAuMCwgMzAuMCwgNTguMCwgMTguMCwgMTIuMCwgMzguMCwgMTMuMCwgMjAuMCwgMTYuMCwgNy4wLCAxMC4wLCA2LjAsIDE1LjAsIDE5LjAsIDMwLjAsIDcuMCwgNy4wLCAyNy4wLCA2LjAsIDEyLjAsIDMzLjAsIDEzLjAsIDUuMCwgNS4wLCAyNi4wLCAxNC4wLCAyOS4wLCAxNi4wLCA4LjAsIDI3LjAsIDYuNzE5OTE1MjU2ODA4NjAwNSwgMTIuNTkzMjMxNTAyNDA3MDE3LCA3LjU1NTUxNDYxNjY3MzUyNiwgMTAuOTA4NTM3NzAzMTcwMjQ4LCA0LjE5NDE4NzA2NzY2NzIyOTUsIDQuMTg5NTc0NjE1MjQ3MTMxLCA3LjUzOTU2NDQwNjAwMTY4OTUsIDQuMTg4MTkwMTM0MDQxMTAwNSwgOS4yMTQzMTMxMDgyNTYyNTYsIDMuMzUwMjc3NDA2NzQzMTc5MywgNC4xODc4NTY5NjAwNzkzNDEsIDUuODYyMjY2OTMxNTM5OTQ2LCA3LjUzNjkxNTgyOTIyMzYzOCwgNC4xODY2OTQ0OTg2NDE3NDIsIDQuMTg2NDczNTQyNTgzMzgyLCA1LjAyMzM5OTEyNTM1Mjg1MSwgNS44NjA1Mzc5NDExODc4NjM1LCA0LjE4NTg2NzUwMzU4Mzc4NSwgOC4zNzE4MzcyNTg4Njk0MDIsIDMuMzQ4Mzk3MTIzMzA5NzU4MiwgMy4zNDc5NzQ4Nzk5OTkyNjE3LCA1Ljg1ODcxMzY4ODgzMzEwNCwgMy4zNDc3NTAyNzkzODQ4NDg2LCAzLjM0NzcwOTQ5MzM5NzI4OTMsIDMuMzQ3Mzc4NTU1NDI1NTE0NCwgNC4xODM3MDIxNzMyMzMzMzksIDMuMzQ2Nzk4MDk0NzE4Mjc2NSwgMy4zNDY3MjEzMjc0ODY4NDUsIDUuMDIwMTI3OTU4NDIxNDksIDUuMDE5OTUzNDU1ODI3NTM0LCAyMC4wNzg1OTc4NDg5MzI3OCwgMTIuNTUwNDQyNDc0NjM0NjM2LCAxNS4wNTM5ODk1NDA3OTkzMzIsIDE0LjIxMDQ1ODgxNDI2NTk2NCwgOS4xOTYxODUzNjg3Njc4MjEsIDE2LjcwMzYxODkwNDM0NzQ0LCA1Ljg1NDU1NTk2ODg5NDQyMiwgNi42ODg3NTcyNjE5NjYyMzUsIDI2LjY3MTg5NTE2MjE4MjE3NCwgMjkuOTg5NTU5MzI2MTYzOTE3LCAyNy40OTU4NTQ4ODQyOTMyODQsIDEwLjg1Njk2ODE0ODI1MTQyOSwgMTAuODU1OTg0NjEyNDUzMTgxLCAyNC4xNjQxOTUyMTg2MDUzOCwgMTAuMDIxOTkwMDM0NzQ2NDM3LCA3LjUyMjQ0OTg0OTczNDk4OSwgMzk5LjI3ODYwMDE3NDA1MjE0LCAyMC44MDc5OTYzMTY5ODE5NDIsIDI0Ljk0NTY5NDUwNjc2MTg2NCwgMTYuNjU2NzU3ODg1ODQxODYzLCA1Ny45MjY2NzI4MDI0NjQ2MSwgNTAuNDg2MjgzNTc3MTQ4NDg0LCA0NC43MDY5MTAzNjc1NDMzNywgNjEuOTkzNDA1MTc5MjAxNDYsIDc5LjIzNTkyMTYwMzQyNTM4LCAzNi40NDkyNzc3ODE1Mjk5LCA2My41NTIzMzU2ODE2MzU5NDUsIDQzLjgzNjM5MDM5NTEyODA2LCA0Ny4xMjE0MDQzNTcyNzI3MSwgMjQuMDY3OTAwMzQyODAzNDgzLCA0MS4zMjc1MzgwMzE5ODI2NCwgMjguMTc3NDc4NDIyMjEyODI1LCAzOC4wMzEyOTY1ODY1ODA5MSwgMjIuNDEyMDI3ODExMzQ2Mjg1LCA1OS4yOTU1NDI4MjE5MjY0NDYsIDU1LjA5MDIwMTMxMDQwNDU0LCAzMy44NjMxOTY4MjY1NTAwNSwgNTAuMTcxMzAyNTg2NjY0MDgsIDI3LjI5NjM4MzE4MjYwMTEzMywgNTguOTI5NzkyNzUzNjkwNDksIDM4LjYwMjE5OTU0MTg2Mzg1NCwgMzQuNTMwMzg2NTUzOTcwMjQ2LCAzMi44ODU3OTE2OTMxMDY2NCwgNC4wNDMwNDYzMzI1ODc4NDMsIDcuMjgwMzY4NzAxNjAxNzI1LCA0LjA0NjA2MDE4MTA3MjAzLCAzLjIzNzEzNjk4MDYwNjY3MjgsIDYuNDc1MTU0NTExMjg4NTIzLCA1LjY2ODUyMjIzNjI5ODMyLCA1LjY2ODY1OTA4MDQ1MzQ3MywgNC4wNTEwNDYyODg5ODM3NzMsIDQuODYxNDg1NjU0NDgyNjQ1LCA0LjA1MTMyNjMzNzY5Mjk0NiwgNC44NjI4NDEyOTEyNzkwNiwgNC4wNTMyMTg1NTgyMjE0NzksIDQuODY0MDIwOTU4Mjg5MDY2LCA1LjY3NTUyNDAyNzk3MzMwOCwgNS42NzU1MDA0MDkxNTI1NTIsIDUuNjc2MjU4ODgyOTM1MTcsIDcuMjk5NjI3NDY5NDQ4MDU4LCA0LjA1NTM1ODMxMDM4NTk3MywgMy4yNDQ3NzAyNDg2ODUwOTksIDMuMjQ0OTU0OTgzMTEwMDI3NSwgMy4yNDUyMTk4NjA0ODY2OTM1LCA1LjY3OTUzMjM0MDY3Mjc1OCwgNS42Nzk4NDgyMDYwNzQ3NTIsIDQuMDU3MTQ2MTEwNzY5MjU1LCA0LjA1NzIyNDkyNTk4NjYzMywgNC44Njg3NzEwMzI5NDk2OTcsIDQuMDU3NDY2ODAwODYzMjA3LCAzLjI0NjE3OTgyNjEwNjUyMSwgMy4yNDYxNjkwNzI2MzAxNTUzLCAzLjI0NjMwNjIwMTkzMDQsIDUuNjgyOTc0ODY5NTA4NDk1LCAxMy44MTQ0NTYxNzk0MzY0NzYsIDYuNDk3Mzg2NjgwNjU5NTI2LCA1MC40ODcxNzIyOTMxMDE4ODUsIDE4LjcyMDA3MDQ4MTA3NDAyNSwgMzAuMTQ0MzY3OTc1MTk1MzU4LCAxNi4yODQ2Mjc2NTM4MDQxMzcsIDguMTI4ODE1NTgzOTM0NDc3LCA4Ljk0NjAyMzA2MjI1MDAyNiwgNTguOTI5NzkyNzUzNjkwNDksIDM4LjQ0MzAzNzc3Nzg5OTI2LCAzOTkuMjc4NjAwMTc0MDUyMTQsIDE5LjU5OTc3MzU5NTc3MTczLCAxMy4wNDIyNDcyMjUzNzIwOTgsIDMwLjI5MTAyMDU2MzUwOTU4NywgMjcuMDA0MDQ0MTEwOTIyMzY1LCAzMy41OTA2ODAxNjMyMTU4MywgNTUuMDkwMjAxMzEwNDA0NTQsIDEzLjg3NDE3NzMwNzAyOTMyOCwgMTEuNDEzNjkyMjI5Mjg1ODE1LCAzOC42MDIxOTk1NDE4NjM4NTQsIDUwLjE3MTMwMjU4NjY2NDA4LCA1OS4yOTU1NDI4MjE5MjY0NDYsIDE5LjY0NTQ2Mjc4OTM3ODM0MiwgNzkuMjM1OTIxNjAzNDI1MzgsIDIxLjI5ODk0MTk0OTEzODY5OCwgMzIuODY3MjE1OTA1MjY3MjcsIDM0LjUzMDM4NjU1Mzk3MDI0NiwgNjMuNTUyMzM1NjgxNjM1OTQ1LCAzMi44ODU3OTE2OTMxMDY2NCwgNjEuOTkzNDA1MTc5MjAxNDYsIDI5LjYzNDA3MjM4Nzg1MjkxLCA1Ny45MjY2NzI4MDI0NjQ2MSwgMjEuMzQxOTg1NTcyOTcxNjU1LCA0Ny4xMjE0MDQzNTcyNzI3MSwgNTAuNDg2MjgzNTc3MTQ4NDg0LCA0MS4zMjc1MzgwMzE5ODI2NCwgNDMuODM2MzkwMzk1MTI4MDYsIDQ0LjcwNjkxMDM2NzU0MzM3LCAzOC4wMzEyOTY1ODY1ODA5MSwgMzMuODYzMTk2ODI2NTUwMDUsIDM2LjQ0OTI3Nzc4MTUyOTldLCAiQ2F0ZWdvcnkiOiBbIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIkRlZmF1bHQiLCAiRGVmYXVsdCIsICJEZWZhdWx0IiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzEiLCAiVG9waWMxIiwgIlRvcGljMSIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiIsICJUb3BpYzIiLCAiVG9waWMyIiwgIlRvcGljMiJdLCAibG9ncHJvYiI6IFszMC4wLCAyOS4wLCAyOC4wLCAyNy4wLCAyNi4wLCAyNS4wLCAyNC4wLCAyMy4wLCAyMi4wLCAyMS4wLCAyMC4wLCAxOS4wLCAxOC4wLCAxNy4wLCAxNi4wLCAxNS4wLCAxNC4wLCAxMy4wLCAxMi4wLCAxMS4wLCAxMC4wLCA5LjAsIDguMCwgNy4wLCA2LjAsIDUuMCwgNC4wLCAzLjAsIDIuMCwgMS4wLCAtNi41NDc5LCAtNS45MzIsIC02LjQ0MzcsIC02LjA4NzQsIC03LjA0OTksIC03LjA3NjcsIC02LjQ5NSwgLTcuMDg0NywgLTYuMjk2NCwgLTcuMzA5NSwgLTcuMDg2NiwgLTYuNzUzNiwgLTYuNTAzOSwgLTcuMDkzNSwgLTcuMDk0OSwgLTYuOTE0OSwgLTYuNzYxMSwgLTcuMDk4MywgLTYuNDA2MSwgLTcuMzIzOCwgLTcuMzI2OCwgLTYuNzY4OCwgLTcuMzI4NSwgLTcuMzI4OCwgLTcuMzMxMiwgLTcuMTExNSwgLTcuMzM1NiwgLTcuMzM2MiwgLTYuOTMxMywgLTYuOTMxNywgLTUuNTQ5MSwgLTYuMDE1NywgLTUuODQ0OSwgLTUuOTE1LCAtNi4zNDY1LCAtNS43NzU5LCAtNi43ODcsIC02LjY2MjIsIC01LjM2MjQsIC01LjI2LCAtNS4zNDExLCAtNi4yMDcxLCAtNi4yMDk5LCAtNS40NjkxLCAtNi4yODY4LCAtNi41NTI5LCAtMi45OTA5LCAtNS42NDk3LCAtNS40OTYzLCAtNS44NTQ3LCAtNC44MDc2LCAtNC45NCwgLTUuMDUwNSwgLTQuNzc5OSwgLTQuNTg4NCwgLTUuMjM0OCwgLTQuODA5NiwgLTUuMTAzNiwgLTUuMDQ5MiwgLTUuNTksIC01LjE4NjQsIC01LjQ3NzcsIC01LjI2MDMsIC01LjY1NTgsIC00Ljk2NTgsIC01LjEwODMsIC01LjQxMjgsIC01LjE4ODcsIC01LjU3NDMsIC01LjI2OTYsIC01LjUxNDEsIC01LjU3OTQsIC01LjYyODQsIC02Ljk0OSwgLTYuMzcwMSwgLTYuOTY2NCwgLTcuMTkxNiwgLTYuNTAxNCwgLTYuNjQ2NCwgLTYuNjQ3MiwgLTYuOTk2MSwgLTYuODE0NywgLTYuOTk3NywgLTYuODIxNiwgLTcuMDA5MSwgLTYuODI3NCwgLTYuNjc2OSwgLTYuNjc2OSwgLTYuNjgwMSwgLTYuNDM0MSwgLTcuMDIyNiwgLTcuMjQ5NywgLTcuMjUxLCAtNy4yNTMyLCAtNi42OTQ0LCAtNi42OTYxLCAtNy4wMzM1LCAtNy4wMzQsIC02Ljg1MjUsIC03LjAzNTYsIC03LjI2MDUsIC03LjI2MDksIC03LjI2MTUsIC02LjcwOTgsIC01Ljg0NTQsIC02LjU4NjIsIC00LjYwNywgLTUuNTg1NywgLTUuMTM3NCwgLTUuNzM2MiwgLTYuMzg1NSwgLTYuMzAyNywgLTQuNjEwMiwgLTUuMDE1NiwgLTMuMDAwNiwgLTUuNjM5NywgLTUuOTkxLCAtNS4yODQsIC01LjM4MzksIC01LjIwNTgsIC00Ljg0MzIsIC01Ljk2NTgsIC02LjEyODksIC01LjE1NjYsIC00Ljk0ODQsIC00LjgzNDUsIC01LjcxMjcsIC00LjY0MTMsIC01LjY1NzksIC01LjMzMzgsIC01LjMwNjgsIC00Ljg2MSwgLTUuMzU1NCwgLTQuOTU2MSwgLTUuNTA4OSwgLTUuMDgxNiwgLTUuNzI4MSwgLTUuMjM3MiwgLTUuMjI2OCwgLTUuMzYwMSwgLTUuMzM0OCwgLTUuMzY1NSwgLTUuNDU2LCAtNS41MjMzLCAtNS42MDE4XSwgImxvZ2xpZnQiOiBbMzAuMCwgMjkuMCwgMjguMCwgMjcuMCwgMjYuMCwgMjUuMCwgMjQuMCwgMjMuMCwgMjIuMCwgMjEuMCwgMjAuMCwgMTkuMCwgMTguMCwgMTcuMCwgMTYuMCwgMTUuMCwgMTQuMCwgMTMuMCwgMTIuMCwgMTEuMCwgMTAuMCwgOS4wLCA4LjAsIDcuMCwgNi4wLCA1LjAsIDQuMCwgMy4wLCAyLjAsIDEuMCwgMC41MzIxLCAwLjUxOTksIDAuNTE5MSwgMC41MDgyLCAwLjUwMTUsIDAuNDc1NywgMC40Njk5LCAwLjQ2ODEsIDAuNDY3OSwgMC40NjY1LCAwLjQ2NjMsIDAuNDYyOSwgMC40NjE0LCAwLjQ1OTYsIDAuNDU4MywgMC40NTYxLCAwLjQ1NTcsIDAuNDU1LCAwLjQ1NDEsIDAuNDUyOCwgMC40NSwgMC40NDgzLCAwLjQ0ODMsIDAuNDQ4LCAwLjQ0NTcsIDAuNDQyMywgMC40NDE1LCAwLjQ0MDksIDAuNDQwMywgMC40Mzk5LCAwLjQzNjMsIDAuNDM5NywgMC40Mjg2LCAwLjQxNjEsIDAuNDE5NywgMC4zOTM1LCAwLjQzMDksIDAuNDIyNSwgMC4zMzksIDAuMzI0MywgMC4zMjk5LCAwLjM5MzIsIDAuMzkwNCwgMC4zMzExLCAwLjM5MzUsIDAuNDE0MiwgMC4wMDQ1LCAwLjMwMDEsIDAuMjcyMSwgMC4zMTc1LCAwLjExODMsIDAuMTIzNCwgMC4xMzQ0LCAwLjA3ODIsIDAuMDI0MywgMC4xNTQzLCAwLjAyMzYsIDAuMTAxLCAwLjA4MzEsIDAuMjE0MiwgMC4wNzcxLCAwLjE2ODgsIDAuMDg2NCwgMC4yMTk3LCAtMC4wNjMzLCAtMC4xMzIyLCAwLjA0OTksIC0wLjExOSwgMC4xMDQxLCAtMC4zNjA5LCAtMC4xODI0LCAtMC4xMzYxLCAtMC4xMzY0LCAwLjYzOTEsIDAuNjI5OCwgMC42MjA5LCAwLjYxODgsIDAuNjE1NywgMC42MDM4LCAwLjYwMjksIDAuNTksIDAuNTg5LCAwLjU4ODMsIDAuNTgxOSwgMC41NzY0LCAwLjU3NTgsIDAuNTcyLCAwLjU3MiwgMC41Njg3LCAwLjU2MzEsIDAuNTYyNCwgMC41NTgzLCAwLjU1NjksIDAuNTU0NiwgMC41NTM4LCAwLjU1MiwgMC41NTExLCAwLjU1MDYsIDAuNTQ5NywgMC41NDg5LCAwLjU0NzEsIDAuNTQ2NywgMC41NDYsIDAuNTM3OCwgMC41MTM5LCAwLjUyNzUsIDAuNDU2NCwgMC40Njk4LCAwLjQ0MTYsIDAuNDU4NiwgMC41MDQyLCAwLjQ5MTIsIDAuMjk4NSwgMC4zMjAzLCAtMC4wMDUyLCAwLjM2OTksIDAuNDI1OSwgMC4yOTAyLCAwLjMwNTIsIDAuMjY1LCAwLjEzMjksIDAuMzg5MiwgMC40MjE0LCAwLjE3NTEsIDAuMTIxMiwgMC4wNjgsIDAuMjk0NSwgLTAuMDI4NiwgMC4yNjg1LCAwLjE1ODcsIDAuMTM2NCwgLTAuMDI3OCwgMC4xMzY2LCAtMC4wOTgsIDAuMDg3MywgLTAuMTU1NywgMC4xOTYzLCAtMC4xMDQ4LCAtMC4xNjM1LCAtMC4wOTY2LCAtMC4xMzAyLCAtMC4xODA1LCAtMC4xMDkzLCAtMC4wNjA2LCAtMC4yMTI3XX0sICJ0b2tlbi50YWJsZSI6IHsiVG9waWMiOiBbMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMiwgMSwgMSwgMiwgMSwgMiwgMSwgMiwgMiwgMSwgMiwgMSwgMiwgMSwgMl0sICJGcmVxIjogWzAuODk2MDY0MDcwODI3Mzk1NywgMC4yOTg2ODgwMjM2MDkxMzE5LCAwLjI4ODMwNTM4MjgzMzI4NzUsIDAuNzIwNzYzNDU3MDgzMjE4OCwgMC4xNTM5MDgwMzI0MzY1ODc4MiwgMC43Njk1NDAxNjIxODI5MzkxLCAwLjI0Njg0OTgwODMzNzAwOTk4LCAwLjc0MDU0OTQyNTAxMTAyOTksIDAuMjY1Mzg5NTQxNjQxMTc0NiwgMC43Mjk4MjEyMzk1MTMyMzAzLCAwLjgyOTAzNTgxMDMxOTM5NDQsIDAuMTg0MjMwMTgwMDcwOTc2NTUsIDAuNDU2MTI0MDM0OTYyNjE5NjYsIDAuNTQ3MzQ4ODQxOTU1MTQzNiwgMC45NTU0MDc2NjE0MTM0ODI3LCAwLjIzODg1MTkxNTM1MzM3MDY2LCAwLjI0NjQ3ODY3NTU3NTgyMTIzLCAwLjczOTQzNjAyNjcyNzQ2MzcsIDAuODk2MjIzNzAxNzE5NTIxOCwgMC4yOTg3NDEyMzM5MDY1MDcyNSwgMC4zMDgxNDU1MzE4ODcwMjIxNSwgMC45MjQ0MzY1OTU2NjEwNjY1LCAwLjc5NjI3MzU3ODk0MjIzMzUsIDAuMTk5MDY4Mzk0NzM1NTU4MzcsIDAuMjA1MzkwNjQwMzE0MDQyNDIsIDAuODIxNTYyNTYxMjU2MTY5NywgMC4yNDY3MTc1MTI0MjUxODU0NCwgMC43NDAxNTI1MzcyNzU1NTYzLCAwLjMwNjEyNTk4NTExMzEzMzMsIDAuNjYzMjcyOTY3NzQ1MTIyMiwgMC45NTM3MDA5MDQ0ODE3NzQ5LCAwLjUwNjE3NDEwMjY5MDk0NjQsIDAuNTA2MTc0MTAyNjkwOTQ2NCwgMC44MzYxMzY2NTQ3ODA3NjEzLCAwLjExOTQ0ODA5MzU0MDEwODc1LCAwLjIxNzE2MzgxNDU2MDExNjYzLCAwLjc5NjI2NzMyMDA1Mzc2MDksIDAuNTYxMDgxMTA4MTIyMTc0NCwgMC40NDI5NTg3Njk1NzAxMzc2MywgMC4yNDY4MzI3NDQ3OTY3MjE2OCwgMC43NDA0OTgyMzQzOTAxNjUsIDAuMTc2MTk1OTE3MTcxODc3NTIsIDAuODgwOTc5NTg1ODU5Mzg3NSwgMC41NTA3MjcyMDE4MzQ1OTEsIDAuNDU2MzE2ODI0Mzc3MjMyNiwgMC4yMjM1NjMwMjc1MTMyNTMyLCAwLjc4MjQ3MDU5NjI5NjM4NjIsIDAuMTc1OTY0MTc3NzM0Njk1MzYsIDAuODc5ODIwODg4NjczNDc2NywgMC43NzgyNzQ0NjEwMjgxMTI4LCAwLjE3OTYwMTc5ODY5ODc5NTI1LCAwLjE3NjQwODU2MjU1NTUwMzYsIDAuODgyMDQyODEyNzc3NTE4LCAwLjM3MDMxNDkwMzkwNTY0NDUsIDAuNjI5NTM1MzM2NjM5NTk1NiwgMC4xNzYxNzIzNzM0OTg3NDA4LCAwLjg4MDg2MTg2NzQ5MzcwNCwgMC43MjE1Njc0MDI5NDg4NjgsIDAuMjgwNjA5NTQ1NTkxMjI2NCwgMC42MDM5MzM0ODA5MzIzMjY4LCAwLjM4MDI1NDQxMzkyMDM1MzksIDAuMzA4MDU1NDI3MDY2NzYyODcsIDAuOTI0MTY2MjgxMjAwMjg4NSwgMC45ODkzNTI5OTU0Nzc0NzQ1LCAwLjY2NDc4NTg2NzE1NTM4NDksIDAuMzMyMzkyOTMzNTc3NjkyNDUsIDAuODUzNDI5NjU0NjIzNzAzNSwgMC4xNzA2ODU5MzA5MjQ3NDA3MSwgMC45MjY0NzU2MDgyMzM1MzkxLCAwLjEzMjM1MzY1ODMxOTA3NywgMC43MjczODIzNjY2OTM1NjI2LCAwLjI1NDU4MzgyODM0Mjc0NjksIDAuMjQ2NDczODg3NTA3NDM3MzIsIDAuNzM5NDIxNjYyNTIyMzExOSwgMC43OTU4MDE5NDI1MTMyNjMsIDAuMTMyNjMzNjU3MDg1NTQzOCwgMC43MzM1ODg2Mzg2NTY4NjkxLCAwLjI2Njc1OTUwNDk2NjEzNDIsIDAuNDQwMzg5NDEzMDg0MTg0NTYsIDAuNTQ0MDEwNDUxNDU2OTMzOCwgMC4zMDgxODgyMzAwOTI3ODkyLCAwLjkyNDU2NDY5MDI3ODM2NzQsIDAuNDIxNzAzOTY3OTQ3NDc5MSwgMC41NjIyNzE5NTcyNjMzMDU1LCAwLjE3NjE5NTE4MzkyODYwOTU2LCAwLjg4MDk3NTkxOTY0MzA0NzgsIDAuNzIwODc2NzEzNTIzNzM4NiwgMC4yODgzNTA2ODU0MDk0OTU0MywgMC43MTcwNjgyNTA5ODQzODQ4LCAwLjIzOTAyMjc1MDMyODEyODI1LCAwLjE3NjQxMjgyMTI0NTgxMDk1LCAwLjg4MjA2NDEwNjIyOTA1NDcsIDAuNzk2NzkyNDM4OTgzNTE2NCwgMC4xOTkxOTgxMDk3NDU4NzkxLCAwLjM3NTYwNTUxMjE5NDE2MzcsIDAuNjEwMzU4OTU3MzE1NTE2LCAwLjQ2MzM2MDAwMjUwMDc2NCwgMC41MjEyODAwMDI4MTMzNTk1LCAwLjIwNTY0MTA5MzM2NTE4NjI0LCAwLjgyMjU2NDM3MzQ2MDc0NSwgMC43OTc2MTI0OTU5MDkzNDQ4LCAwLjEzMjkzNTQxNTk4NDg5MDc4LCAwLjg5NjM3OTE0MDYyODI5OTgsIDAuMjk4NzkzMDQ2ODc2MSwgMC4zMDgwNTQ0MDY1ODUxNzE2NCwgMC45MjQxNjMyMTk3NTU1MTQ5LCAwLjYzMTAxMzg3NDYxOTM0NTMsIDAuMzg0MDk1NDAxOTQyMjEwMjYsIDAuODkyODY4NDAyNDU4MDI0NSwgMC4xNDg4MTE0MDA0MDk2NzA3MiwgMC4yNjcwOTMwMTE0ODQ5MTkxNSwgMC43NDc4NjA0MzIxNTc3NzM1LCAwLjI0NjAzODMwNDAyNDYwMjgsIDAuNzM4MTE0OTEyMDczODA4NCwgMC4zODcwMTIxMDk4MTI0MDkyLCAwLjU5NTQwMzI0NTg2NTI0NSwgMC44NzM0ODUwOTM3OTAwNjU0LCAwLjA3OTQwNzczNTc5OTA5Njg3LCAwLjc0NzUyMzAxNTczNzMzNSwgMC4xNDk1MDQ2MDMxNDc0NjcsIDAuODY4MjE0NDczMDcxNDQzNSwgMC4xMDg1MjY4MDkxMzM5MzA0NCwgMC44OTYxMzUxMDU0ODUzODM3LCAwLjI5ODcxMTcwMTgyODQ2MTIsIDAuNzk2Nzg0NjU2ODEyNzU2NSwgMC4xNTkzNTY5MzEzNjI1NTEyNywgMC43MjA0MjgzMTM5NzU3OTAxLCAwLjI0MDE0Mjc3MTMyNTI2MzM4LCAwLjEzNzM1NTY4MDg3MDk0MTg4LCAwLjgyNDEzNDA4NTIyNTY1MTIsIDAuODQ0NDQ4NDU1NjY1MTQyMiwgMC4yMTExMTIxMTM5MTYyODU1NCwgMC41MzU5NjY2MTU1NTc5NDM0LCAwLjQ2MzMzNTYyNTU5OTE1NjcsIDAuNjA0MjEyMTU4MzQ5ODAzNSwgMC4zOTcwNTM3MDQwNTg0NDIyNiwgMC4yNjI4NDIyMDIxMzE3OTE1LCAwLjcwMDkxMjUzOTAxODExMDcsIDAuOTU1NDU4MDg2NDU3MTAxMywgMC4yMzg4NjQ1MjE2MTQyNzUzMiwgMC43OTYwODE1OTgzNTU2MDMyLCAwLjEzMjY4MDI2NjM5MjYwMDUzLCAwLjc5NjgyMDEzNjkxOTA5OSwgMC4xOTkyMDUwMzQyMjk3NzQ3NiwgMC40NTYzODE4MjU2ODQxMTkyLCAwLjU0NzY1ODE5MDgyMDk0MzEsIDAuODk1OTUxMDc0MzU2MDI0NiwgMC4yOTg2NTAzNTgxMTg2NzQ4NSwgMC41MDU5NDAyMjAzMzE0NzcxLCAwLjUwNTk0MDIyMDMzMTQ3NzEsIDAuMTM2OTkzMjkyMzU0MzU3OTUsIDAuODIxOTU5NzU0MTI2MTQ3NywgMC4zMDgwNDI0MTQzMDAwOTEyNywgMC45MjQxMjcyNDI5MDAyNzM3LCAwLjIwNTU5MTIxOTM5OTYyODgsIDAuODIyMzY0ODc3NTk4NTE1MiwgMC44NTMxNjQwMDEzNTU1NzQ4LCAwLjE3MDYzMjgwMDI3MTExNDk2LCAwLjU0MjY4MzE1NTk0NTUzNjUsIDAuNDU0MzM5Mzg2MzczMDA3MywgMC4xNzYwNjEwNDMxMzMyNDMwNiwgMC44ODAzMDUyMTU2NjYyMTUyLCAwLjU3ODQ3MDk0MzAwMTI1ODUsIDAuNDIwNzA2MTQwMzY0NTUxNiwgMC41ODA3MDY5Mjk5Njk5OTQsIDAuNDE5Mzk5NDQ5NDIyNzczNCwgMC4yNTc0OTExNDg5MzA0NDIzNCwgMC43MzI4NTk0MjM4Nzg5NTEzLCAwLjc0NDkwMzc2NTE0MzQyOTQsIDAuMjQ4MzAxMjU1MDQ3ODA5NzgsIDAuODk2MTI0MTg3Nzc4ODAwNSwgMC4yOTg3MDgwNjI1OTI5MzM1MywgMC40NzgzNjExMTAwODk2NDI4LCAwLjUxODIyNDUzNTkzMDQ0NjQsIDAuNzk4MjQ0NjU3MjI1MTQ2MSwgMC4xOTk1NjExNjQzMDYyODY1NCwgMC41OTMxMTQ1MjgwMzU4MTIzLCAwLjQxMDYxNzc1MDE3ODYzOTMzLCAwLjMwODE3MDY4NTAxODc0MjczLCAwLjkyNDUxMjA1NTA1NjIyODIsIDAuMzU2MzE2MzcwNjA2Njg2MzYsIDAuNjEwODI4MDYzODk3MTc2NiwgMC45NTU1OTY0MTk3NTY1NjEyLCAwLjIzODg5OTEwNDkzOTE0MDMsIDAuMzczMzI1NTk1OTY3MjgzNCwgMC42Mjc4NjU3NzUwMzU4ODU3LCAwLjU3Mjk4ODAxNjEzMTQxNywgMC40MjQ0MzU1Njc1MDQ3NTMzNiwgMC4zNjQxNzUxNzQ3MzIxMjEyNCwgMC42NTAzMTI4MTIwMjE2NDUsIDAuOTU1MDY2NDc3ODc3NTE3MSwgMC4yMzg3NjY2MTk0NjkzNzkyNywgMC44Mjg5NjA3MDc3MzIxNTc5LCAwLjE4NDIxMzQ5MDYwNzE0NjIsIDAuOTU0NzUwODY3ODkwNjg5NSwgMC4yMzg2ODc3MTY5NzI2NzIzOCwgMC45NTUxNDI0NjAyNDM5NjYzLCAwLjIzODc4NTYxNTA2MDk5MTU4LCAwLjU4NjE1ODI0Mjc1OTM3MzcsIDAuNDAyOTgzNzkxODk3MDY5NCwgMC4xNTQ0MzY0NjkxNjE3MjI3NCwgMC45MjY2MTg4MTQ5NzAzMzY1LCAwLjM2MzE0MzkyMTcwODk3MjUsIDAuNjI3MjQ4NTkyMDQyNzcwNiwgMC4xNzYwNzA4MzQ3MTI2OTUyLCAwLjg4MDM1NDE3MzU2MzQ3NiwgMC44OTYzOTk3MDE4MDk4ODc5LCAwLjI5ODc5OTkwMDYwMzI5NiwgMC4zMDY2OTU2MTI0MTA5MTEsIDAuNjkwMDY1MTI3OTI0NTQ5NywgMC42MTQwMjgxNjM3NjExMjY1LCAwLjM5NjE0NzIwMjQyNjUzMzIzLCAwLjg1NDAzNTczMzI5MzA1ODUsIDAuMTcwODA3MTQ2NjU4NjExNjksIDAuNzYxMTg1MTc4MzQyOTEwNywgMC4yMTc0ODE0Nzk1MjY1NDU5LCAwLjc0OTg1Mjk3NzM5MDE0MSwgMC4yNjI0NDg1NDIwODY1NDkzMywgMC42NjkyODM0ODE0NTMwMzEyLCAwLjMxMjMzMjI5MTM0NDc0NzksIDAuNjM4ODA4MDQ4NDA5NjkyNiwgMC4zNTQ4OTMzNjAyMjc2MDcwNCwgMC41ODA3MjY1ODQzMjgwMjkxLCAwLjQxMTM0Nzk5NzIzMjM1NCwgMC4yNDY1ODczMzU0MzY5MDg0LCAwLjczOTc2MjAwNjMxMDcyNTIsIDAuODUyOTEyMzczMDQ0NDk0MSwgMC4xNzA1ODI0NzQ2MDg4OTg4MywgMC44NDY2NzI2Njc0NzkyOTc0LCAwLjE0OTQxMjgyMzY3MjgxNzIsIDAuMjQ2NDU5MTk0NjM1MjQ3NDksIDAuNzM5Mzc3NTgzOTA1NzQyNSwgMC44OTU0NDgyMzc3OTcyMTQsIDAuOTE2NzEzMTUzNjg4MjE1NCwgMC4wOTE2NzEzMTUzNjg4MjE1NSwgMC4yNDU2MzA0MjQyODk0NzMzLCAwLjczNjg5MTI3Mjg2ODQxOTgsIDAuMjQ3MTU0MDEwMzgyMjc4NDcsIDAuOTg4NjE2MDQxNTI5MTEzOSwgMC45MjY3NDQ4NDIxMTU5Mzk0LCAwLjIwNTY5ODQzNjg3MTQzODA1LCAwLjgyMjc5Mzc0NzQ4NTc1MjIsIDAuNDcxOTUzMjU4MTM5Mzg0MywgMC41MjY0MDk0MDMzMDkzMTMzLCAwLjc5NzEzMDg4NDYzODc1OTMsIDAuMTk5MjgyNzIxMTU5Njg5OF0sICJUZXJtIjogWyJhY2Nlc3MiLCAiYWNjZXNzIiwgImFjY3VyYWN5IiwgImFjY3VyYWN5IiwgImFsZ29yaXRobXMiLCAiYWxnb3JpdGhtcyIsICJhbHRlcm5hdGl2ZSIsICJhbHRlcm5hdGl2ZSIsICJhbmFseXNpcyIsICJhbmFseXNpcyIsICJhcHBsaWNhdGlvbiIsICJhcHBsaWNhdGlvbiIsICJhcHBsaWNhdGlvbnMiLCAiYXBwbGljYXRpb25zIiwgImFyIiwgImFyIiwgImFyY2hpdGVjdHVyZSIsICJhcmNoaXRlY3R1cmUiLCAiYXJ0IiwgImFydCIsICJhc3luY2hyb25vdXMiLCAiYXN5bmNocm9ub3VzIiwgImF1dG9tb3RpdmUiLCAiYXV0b21vdGl2ZSIsICJhdXhpbGlhcnkiLCAiYXV4aWxpYXJ5IiwgImF4IiwgImF4IiwgImF4aXMiLCAiYXhpcyIsICJiYXJyaWVycyIsICJiYXNlIiwgImJhc2UiLCAiY2FsY3VsYXRlIiwgImNhbGN1bGF0ZSIsICJjbGFzc2lmaWNhdGlvbiIsICJjbGFzc2lmaWNhdGlvbiIsICJjb21wYXJlIiwgImNvbXBhcmUiLCAiY29tcHV0ZSIsICJjb21wdXRlIiwgImNvbnRvdXIiLCAiY29udG91ciIsICJjb250cm9sIiwgImNvbnRyb2wiLCAiY29udHJvbGxlciIsICJjb250cm9sbGVyIiwgImNvbnZlcnRlcnMiLCAiY29udmVydGVycyIsICJjb3JlIiwgImNvcmUiLCAiY3Jvc3MiLCAiY3Jvc3MiLCAiY3VycmVudCIsICJjdXJyZW50IiwgImN1cnJlbnRzIiwgImN1cnJlbnRzIiwgImRhdGEiLCAiZGF0YSIsICJkZXNpZ24iLCAiZGVzaWduIiwgImRldGVybWluYXRpb24iLCAiZGV0ZXJtaW5hdGlvbiIsICJkaWFnbm9zaXMiLCAiZGlmZmVyZW50IiwgImRpZmZlcmVudCIsICJkaWdpdGFsIiwgImRpZ2l0YWwiLCAiZHJpbGwiLCAiZHJpbGwiLCAiZHJpdmUiLCAiZHJpdmUiLCAiZWFzeSIsICJlYXN5IiwgImVmZmljaWVudCIsICJlZmZpY2llbnQiLCAiZWxlY3RyaWMiLCAiZWxlY3RyaWMiLCAiZWxlY3RyaWNhbCIsICJlbGVjdHJpY2FsIiwgImVsZWN0cm8iLCAiZWxlY3RybyIsICJlbGVtZW50IiwgImVsZW1lbnQiLCAiZXF1aXZhbGVudCIsICJlcXVpdmFsZW50IiwgImVycm9yIiwgImVycm9yIiwgImVzdGFibGlzaCIsICJlc3RhYmxpc2giLCAiZXhpc3QiLCAiZXhpc3QiLCAiZmUiLCAiZmUiLCAiZmluaXRlIiwgImZpbml0ZSIsICJmbHV4IiwgImZsdXgiLCAiZnJhbWUiLCAiZnJhbWUiLCAiZ3JpbmQiLCAiZ3JpbmQiLCAiZ3VpZGUiLCAiZ3VpZGUiLCAiaGVzZnBtbXMiLCAiaGVzZnBtbXMiLCAiaGlnaCIsICJoaWdoIiwgImhpbHMiLCAiaGlscyIsICJpbXByb3ZlIiwgImltcHJvdmUiLCAiaW5kdWN0YW5jZSIsICJpbmR1Y3RhbmNlIiwgImluZHVjdGlvbiIsICJpbmR1Y3Rpb24iLCAiaW5zdWxhdGlvbiIsICJpbnN1bGF0aW9uIiwgImlwbXNtIiwgImlwbXNtIiwgImlzc3VlIiwgImlzc3VlIiwgImt2IiwgImt2IiwgImxheWVyIiwgImxheWVyIiwgImxldmVsIiwgImxldmVsIiwgImxpbmUiLCAibGluZSIsICJsaW5lYXIiLCAibGluZWFyIiwgIm1hY2hpbmUiLCAibWFjaGluZSIsICJtYWduZXQiLCAibWFnbmV0IiwgIm1haW4iLCAibWFpbiIsICJtYWxpY2lvdXMiLCAibWFsaWNpb3VzIiwgIm1heGltdW0iLCAibWF4aW11bSIsICJtZWFzdXJlIiwgIm1lYXN1cmUiLCAibWV0aG9kIiwgIm1ldGhvZCIsICJtaWNyb2NvbnRyb2xsZXIiLCAibWljcm9jb250cm9sbGVyIiwgIm1vZGVsIiwgIm1vZGVsIiwgIm1vdGlvbiIsICJtb3Rpb24iLCAibW90aXZlIiwgIm1vdGl2ZSIsICJvdXRlciIsICJvdXRlciIsICJvdmVyYWxsIiwgIm92ZXJhbGwiLCAicGFwZXIiLCAicGFwZXIiLCAicGFyYW1ldGVyIiwgInBhcmFtZXRlciIsICJwZXJmb3JtYW5jZSIsICJwZXJmb3JtYW5jZSIsICJwZXJtYW5lbnQiLCAicGVybWFuZW50IiwgInBoYXNlIiwgInBoYXNlIiwgInBtIiwgInBtIiwgInBtc21zIiwgInBtc21zIiwgInBvd2VyIiwgInBvd2VyIiwgInByZWRpY3QiLCAicHJlZGljdCIsICJwcmVzZW50IiwgInByZXNlbnQiLCAicHJpY2UiLCAicHJpY2UiLCAicHJvY2VzcyIsICJwcm9jZXNzIiwgInByb3BlcnRpZXMiLCAicHJvcGVydGllcyIsICJwcm9wb3NlIiwgInByb3Bvc2UiLCAicmVzdWx0IiwgInJlc3VsdCIsICJyb3RvciIsICJyb3RvciIsICJyb3YiLCAicm92IiwgInNjYWxlIiwgInNjYWxlIiwgInNlYSIsICJzZWEiLCAic2VydmljZSIsICJzZXJ2aWNlIiwgInNwZWVkIiwgInNwZWVkIiwgInN0YXJ0IiwgInN0YXJ0IiwgInN0YXRvciIsICJzdGF0b3IiLCAic3VwZXJpbXBvc2l0aW9uIiwgInN1cGVyaW1wb3NpdGlvbiIsICJzdXJ2ZXkiLCAic3VydmV5IiwgInN2bSIsICJzdm0iLCAic3luY2hyb25vdXMiLCAic3luY2hyb25vdXMiLCAic3lucmVsIiwgInN5bnJlbCIsICJ0ZW1wZXJhdHVyZSIsICJ0ZW1wZXJhdHVyZSIsICJ0ZXN0IiwgInRlc3QiLCAidGhlcm1hbCIsICJ0aGVybWFsIiwgInRpbWUiLCAidGltZSIsICJ0b3JxdWUiLCAidG9ycXVlIiwgInRyYW5zaWVudCIsICJ0cmFuc2llbnQiLCAidHJlbmQiLCAidHJlbmQiLCAidHVybiIsICJ0dXJuIiwgInZhbHVlIiwgInZhbHVlIiwgInZhcmlhdGlvbiIsICJ2YXJ5IiwgInZhcnkiLCAidmVjdG9yIiwgInZlY3RvciIsICJ2ZnQiLCAidmZ0IiwgIndhdmVsZXQiLCAid2ViIiwgIndlYiIsICJ3aW5kIiwgIndpbmQiLCAid29yayIsICJ3b3JrIl19LCAiUiI6IDMwLCAibGFtYmRhLnN0ZXAiOiAwLjAxLCAicGxvdC5vcHRzIjogeyJ4bGFiIjogIlBDMSIsICJ5bGFiIjogIlBDMiJ9LCAidG9waWMub3JkZXIiOiBbMiwgMV19OwoKZnVuY3Rpb24gTERBdmlzX2xvYWRfbGliKHVybCwgY2FsbGJhY2spewogIHZhciBzID0gZG9jdW1lbnQuY3JlYXRlRWxlbWVudCgnc2NyaXB0Jyk7CiAgcy5zcmMgPSB1cmw7CiAgcy5hc3luYyA9IHRydWU7CiAgcy5vbnJlYWR5c3RhdGVjaGFuZ2UgPSBzLm9ubG9hZCA9IGNhbGxiYWNrOwogIHMub25lcnJvciA9IGZ1bmN0aW9uKCl7Y29uc29sZS53YXJuKCJmYWlsZWQgdG8gbG9hZCBsaWJyYXJ5ICIgKyB1cmwpO307CiAgZG9jdW1lbnQuZ2V0RWxlbWVudHNCeVRhZ05hbWUoImhlYWQiKVswXS5hcHBlbmRDaGlsZChzKTsKfQoKaWYodHlwZW9mKExEQXZpcykgIT09ICJ1bmRlZmluZWQiKXsKICAgLy8gYWxyZWFkeSBsb2FkZWQ6IGp1c3QgY3JlYXRlIHRoZSB2aXN1YWxpemF0aW9uCiAgICFmdW5jdGlvbihMREF2aXMpewogICAgICAgbmV3IExEQXZpcygiIyIgKyAibGRhdmlzX2VsOTQxNDAzMzI0NjU3NzMwMjQ5MjE4MjY4ODExIiwgbGRhdmlzX2VsOTQxNDAzMzI0NjU3NzMwMjQ5MjE4MjY4ODExX2RhdGEpOwogICB9KExEQXZpcyk7Cn1lbHNlIGlmKHR5cGVvZiBkZWZpbmUgPT09ICJmdW5jdGlvbiIgJiYgZGVmaW5lLmFtZCl7CiAgIC8vIHJlcXVpcmUuanMgaXMgYXZhaWxhYmxlOiB1c2UgaXQgdG8gbG9hZCBkMy9MREF2aXMKICAgcmVxdWlyZS5jb25maWcoe3BhdGhzOiB7ZDM6ICJodHRwczovL2QzanMub3JnL2QzLnY1In19KTsKICAgcmVxdWlyZShbImQzIl0sIGZ1bmN0aW9uKGQzKXsKICAgICAgd2luZG93LmQzID0gZDM7CiAgICAgIExEQXZpc19sb2FkX2xpYigiaHR0cHM6Ly9jZG4uanNkZWxpdnIubmV0L2doL2JtYWJleS9weUxEQXZpc0AzLjMuMS9weUxEQXZpcy9qcy9sZGF2aXMudjMuMC4wLmpzIiwgZnVuY3Rpb24oKXsKICAgICAgICBuZXcgTERBdmlzKCIjIiArICJsZGF2aXNfZWw5NDE0MDMzMjQ2NTc3MzAyNDkyMTgyNjg4MTEiLCBsZGF2aXNfZWw5NDE0MDMzMjQ2NTc3MzAyNDkyMTgyNjg4MTFfZGF0YSk7CiAgICAgIH0pOwogICAgfSk7Cn1lbHNlewogICAgLy8gcmVxdWlyZS5qcyBub3QgYXZhaWxhYmxlOiBkeW5hbWljYWxseSBsb2FkIGQzICYgTERBdmlzCiAgICBMREF2aXNfbG9hZF9saWIoImh0dHBzOi8vZDNqcy5vcmcvZDMudjUuanMiLCBmdW5jdGlvbigpewogICAgICAgICBMREF2aXNfbG9hZF9saWIoImh0dHBzOi8vY2RuLmpzZGVsaXZyLm5ldC9naC9ibWFiZXkvcHlMREF2aXNAMy4zLjEvcHlMREF2aXMvanMvbGRhdmlzLnYzLjAuMC5qcyIsIGZ1bmN0aW9uKCl7CiAgICAgICAgICAgICAgICAgbmV3IExEQXZpcygiIyIgKyAibGRhdmlzX2VsOTQxNDAzMzI0NjU3NzMwMjQ5MjE4MjY4ODExIiwgbGRhdmlzX2VsOTQxNDAzMzI0NjU3NzMwMjQ5MjE4MjY4ODExX2RhdGEpOwogICAgICAgICAgICB9KQogICAgICAgICB9KTsKfQo8L3NjcmlwdD4=","topics":[{"id":0,"name":"machine-phase-propose-paper-model"},{"id":1,"name":"machine-paper-permanent-magnet-control"}]}
